{
  "200.1": {
    "ruleNumber": "200.1",
    "examples": null,
    "ruleText": "The parts of a card are name, mana cost, illustration, color indicator, type line, expansion symbol, text box, power and toughness, loyalty, hand modifier, life modifier, illustration credit, legal text, and collector number. Some cards may have more than one of any or all of these parts.",
    "fragment": "1",
    "navigation": {
      "previousRule": "123.9",
      "nextRule": "200.2"
    }
  },
  "200.2": {
    "ruleNumber": "200.2",
    "examples": null,
    "ruleText": "Some parts of a card are also characteristics of the object that has them. See rule 109.3.",
    "fragment": "2",
    "navigation": {
      "previousRule": "200.1",
      "nextRule": "200.3"
    }
  },
  "200.3": {
    "ruleNumber": "200.3",
    "examples": null,
    "ruleText": "Some objects that aren’t cards (tokens, copies of cards, and copies of spells) have some of the parts of a card, but only the ones that are also characteristics. See rule 111 and rule 707.",
    "fragment": "3",
    "navigation": {
      "previousRule": "200.2",
      "nextRule": null
    }
  },
  "201.1": {
    "ruleNumber": "201.1",
    "examples": null,
    "ruleText": "The name of a card is printed on its upper left corner.",
    "fragment": "1",
    "navigation": {
      "previousRule": "200.3",
      "nextRule": "201.2"
    }
  },
  "201.2": {
    "ruleNumber": "201.2",
    "examples": null,
    "ruleText": "A card’s name is always considered to be the English version of its name, regardless of printed language.",
    "fragment": "2",
    "navigation": {
      "previousRule": "201.1",
      "nextRule": "201.2a"
    }
  },
  "201.3": {
    "ruleNumber": "201.3",
    "examples": null,
    "ruleText": "Some cards with different English names are treated as though they had the same English name. Pairs of cards with this property have names that are interchangeable.",
    "fragment": "3",
    "navigation": {
      "previousRule": "201.2c",
      "nextRule": "201.3a"
    }
  },
  "201.4": {
    "ruleNumber": "201.4",
    "examples": null,
    "ruleText": "If an effect instructs a player to choose a card name, the player must choose the name of a card in the Oracle card reference. (See rule 108.1.) A player may not choose the name of a token unless it’s also the name of a card.",
    "fragment": "4",
    "navigation": {
      "previousRule": "201.3c",
      "nextRule": "201.4a"
    }
  },
  "201.5": {
    "ruleNumber": "201.5",
    "examples": null,
    "ruleText": "Text that refers to the object it’s on by name means just that particular object and not any other objects with that name, regardless of any name changes caused by game effects.",
    "fragment": "5",
    "navigation": {
      "previousRule": "201.4g",
      "nextRule": "201.5a"
    }
  },
  "201.6": {
    "ruleNumber": "201.6",
    "examples": null,
    "ruleText": "Promotional or alternate-art versions of some cards feature a secondary title bar below the name line. The card’s name as listed in the Oracle card reference is displayed in the secondary title bar, and an alternate name appears in the upper left corner. For the purposes of deck construction, game rules, and effects, these cards have only the card name specified in the secondary title bar. Rules text may also refer to a card’s alternate name; instances of the alternate name that are present in rules text refer to the name specified in the secondary title bar. The alternate name has no effect on game play.",
    "fragment": "6",
    "navigation": {
      "previousRule": "201.5c",
      "nextRule": null
    }
  },
  "202.1": {
    "ruleNumber": "202.1",
    "examples": null,
    "ruleText": "A card’s mana cost is indicated by mana symbols near the top of the card. (See rule 107.4.) On most cards, these symbols are printed in the upper right corner. Some cards from the Future Sight set have alternate frames in which the mana symbols appear to the left of the illustration.",
    "fragment": "1",
    "navigation": {
      "previousRule": "201.6",
      "nextRule": "202.1a"
    }
  },
  "202.2": {
    "ruleNumber": "202.2",
    "examples": null,
    "ruleText": "An object is the color or colors of the mana symbols in its mana cost, regardless of the color of its frame.",
    "fragment": "2",
    "navigation": {
      "previousRule": "202.1b",
      "nextRule": "202.2a"
    }
  },
  "202.3": {
    "ruleNumber": "202.3",
    "examples": [
      "A mana cost of {3}{U}{U} translates to a mana value of 5."
    ],
    "ruleText": "The mana value of an object is a number equal to the total amount of mana in its mana cost, regardless of color.",
    "fragment": "3",
    "navigation": {
      "previousRule": "202.2f",
      "nextRule": "202.3a"
    }
  },
  "202.4": {
    "ruleNumber": "202.4",
    "examples": null,
    "ruleText": "Any additional cost listed in an object’s rules text or imposed by an effect isn’t part of the mana cost. (See rule 601, “Casting Spells.”) Such costs are paid at the same time as the spell’s other costs.",
    "fragment": "4",
    "navigation": {
      "previousRule": "202.3g",
      "nextRule": null
    }
  },
  "203.1": {
    "ruleNumber": "203.1",
    "examples": null,
    "ruleText": "The illustration is printed on the upper half of a card and has no effect on game play. For example, a creature doesn’t have the flying ability unless stated in its rules text, even if it’s depicted as flying.",
    "fragment": "1",
    "navigation": {
      "previousRule": "202.4",
      "nextRule": null
    }
  },
  "204.1": {
    "ruleNumber": "204.1",
    "examples": null,
    "ruleText": "The color indicator is printed to the left of the type line directly below the illustration. It consists of a circular symbol filled in with one or more colors. A color indicator is usually found on nonland cards without a mana cost.",
    "fragment": "1",
    "navigation": {
      "previousRule": "203.1",
      "nextRule": "204.2"
    }
  },
  "204.2": {
    "ruleNumber": "204.2",
    "examples": null,
    "ruleText": "An object with a color indicator is each color denoted by that color indicator.",
    "fragment": "2",
    "navigation": {
      "previousRule": "204.1",
      "nextRule": null
    }
  },
  "205.1": {
    "ruleNumber": "205.1",
    "examples": null,
    "ruleText": "The type line is printed directly below the illustration. It contains the card’s card type(s). It also contains the card’s subtype(s) and supertype(s), if applicable.",
    "fragment": "1",
    "navigation": {
      "previousRule": "204.2",
      "nextRule": "205.1a"
    }
  },
  "205.2": {
    "ruleNumber": "205.2",
    "examples": null,
    "ruleText": "Card Types",
    "fragment": "2",
    "navigation": {
      "previousRule": "205.1b",
      "nextRule": "205.2a"
    }
  },
  "205.3": {
    "ruleNumber": "205.3",
    "examples": null,
    "ruleText": "Subtypes",
    "fragment": "3",
    "navigation": {
      "previousRule": "205.2c",
      "nextRule": "205.3a"
    }
  },
  "205.4": {
    "ruleNumber": "205.4",
    "examples": null,
    "ruleText": "Supertypes",
    "fragment": "4",
    "navigation": {
      "previousRule": "205.3q",
      "nextRule": "205.4a"
    }
  },
  "206.1": {
    "ruleNumber": "206.1",
    "examples": null,
    "ruleText": "The expansion symbol indicates which Magic set a card is from. It’s a small icon normally printed below the right edge of the illustration. It has no effect on game play.",
    "fragment": "1",
    "navigation": {
      "previousRule": "205.4h",
      "nextRule": "206.2"
    }
  },
  "206.2": {
    "ruleNumber": "206.2",
    "examples": null,
    "ruleText": "The color of the expansion symbol indicates the rarity of the card within its set. A red-orange symbol indicates the card is mythic rare. A gold symbol indicates the card is rare. A silver symbol indicates the card is uncommon. A black or white symbol indicates the card is common or is a basic land. A purple symbol signifies a special rarity; to date, only the Time Spiral® “timeshifted” cards, which were rarer than that set’s rare cards, have had purple expansion symbols. (Prior to the Exodus™ set, all expansion symbols were black, regardless of rarity. Also, prior to the Sixth Edition core set, with the exception of the Simplified Chinese Fifth Edition core set, Magic core sets didn’t have expansion symbols at all.)",
    "fragment": "2",
    "navigation": {
      "previousRule": "206.1",
      "nextRule": "206.3"
    }
  },
  "206.3": {
    "ruleNumber": "206.3",
    "examples": null,
    "ruleText": "Previously, a spell or ability that affected cards from a particular set checked for that set’s expansion symbol. These cards have received errata in the Oracle card reference to say they affect cards “with a name originally printed” in a particular set.",
    "fragment": "3",
    "navigation": {
      "previousRule": "206.2",
      "nextRule": "206.3a"
    }
  },
  "206.4": {
    "ruleNumber": "206.4",
    "examples": null,
    "ruleText": "Players may include cards from any printing in their constructed decks if those cards appear in sets allowed in that format (or those cards are specifically allowed by the Magic: The Gathering Tournament Rules). See the Magic: The Gathering Tournament Rules for the current definitions of the constructed formats (WPN.Wizards.com/en/resources/rules-documents).",
    "fragment": "4",
    "navigation": {
      "previousRule": "206.3c",
      "nextRule": "206.5"
    }
  },
  "206.5": {
    "ruleNumber": "206.5",
    "examples": null,
    "ruleText": "The full list of expansions and expansion symbols can be found in the Card Set Archive section of the Magic website (Magic.Wizards.com/en/game-info/products/card-set-archive).",
    "fragment": "5",
    "navigation": {
      "previousRule": "206.4",
      "nextRule": null
    }
  },
  "207.1": {
    "ruleNumber": "207.1",
    "examples": null,
    "ruleText": "The text box is printed on the lower half of the card. It usually contains rules text defining the card’s abilities.",
    "fragment": "1",
    "navigation": {
      "previousRule": "206.5",
      "nextRule": "207.2"
    }
  },
  "207.2": {
    "ruleNumber": "207.2",
    "examples": null,
    "ruleText": "The text box may also contain italicized text that has no game function.",
    "fragment": "2",
    "navigation": {
      "previousRule": "207.1",
      "nextRule": "207.2a"
    }
  },
  "207.3": {
    "ruleNumber": "207.3",
    "examples": null,
    "ruleText": "Some cards have decorative icons in the background of their text boxes. For example, a guild icon appears in the text box of many cards associated with the guilds of Ravnica, and a faction icon appears in the text box of most Scars of Mirrodin™ block cards. Similarly, many promotional cards include decorative icons. These icons have no effect on game play.",
    "fragment": "3",
    "navigation": {
      "previousRule": "207.2d",
      "nextRule": "207.4"
    }
  },
  "207.4": {
    "ruleNumber": "207.4",
    "examples": null,
    "ruleText": "The chaos symbol {CHAOS} appears in the text box of each plane card to the left of a triggered ability that triggers whenever {CHAOS} is rolled on the planar die. The symbol itself has no special rules meaning. See rule 901, “Planechase.”",
    "fragment": "4",
    "navigation": {
      "previousRule": "207.3",
      "nextRule": "207.5"
    }
  },
  "207.5": {
    "ruleNumber": "207.5",
    "examples": null,
    "ruleText": "One card (Cryptic Spires) has a set of symbols below the text box that represent each color and an ability that instructs a player to circle two of those colors as they create their deck. To circle a color, the player circles (or otherwise clearly indicates) that color’s symbol. The mana symbol of each circled color is considered part of that card’s printed rules text (see rule 613.1) and affects that card’s color identity (see rule 903.4).",
    "fragment": "5",
    "navigation": {
      "previousRule": "207.4",
      "nextRule": null
    }
  },
  "208.1": {
    "ruleNumber": "208.1",
    "examples": null,
    "ruleText": "A creature card has two numbers separated by a slash printed in its lower right corner. The first number is its power (the amount of damage it deals in combat); the second is its toughness (the amount of damage needed to destroy it). For example, 2/3 means the object has power 2 and toughness 3. Power and toughness can be modified or set to particular values by effects.",
    "fragment": "1",
    "navigation": {
      "previousRule": "207.5",
      "nextRule": "208.2"
    }
  },
  "208.2": {
    "ruleNumber": "208.2",
    "examples": null,
    "ruleText": "Rather than a fixed number, some creature cards have power and/or toughness that includes a star (*).",
    "fragment": "2",
    "navigation": {
      "previousRule": "208.1",
      "nextRule": "208.2a"
    }
  },
  "208.3": {
    "ruleNumber": "208.3",
    "examples": null,
    "ruleText": "A noncreature permanent has no power or toughness, even if it’s a card with a power and toughness printed on it (such as a Vehicle). A noncreature object not on the battlefield has power or toughness only if it has a power and toughness printed on it.",
    "fragment": "3",
    "navigation": {
      "previousRule": "208.2b",
      "nextRule": "208.3a"
    }
  },
  "208.4": {
    "ruleNumber": "208.4",
    "examples": null,
    "ruleText": "Some effects refer to a creature’s “base power,” “base toughness,” or “base power and toughness.”",
    "fragment": "4",
    "navigation": {
      "previousRule": "208.3a",
      "nextRule": "208.4a"
    }
  },
  "208.5": {
    "ruleNumber": "208.5",
    "examples": null,
    "ruleText": "If a creature somehow has no value for its power, its power is 0. The same is true for toughness.",
    "fragment": "5",
    "navigation": {
      "previousRule": "208.4b",
      "nextRule": null
    }
  },
  "209.1": {
    "ruleNumber": "209.1",
    "examples": null,
    "ruleText": "Each planeswalker card has a loyalty number printed in its lower right corner. This indicates its loyalty while it’s not on the battlefield, and it also indicates that the planeswalker enters the battlefield with that many loyalty counters on it (see rule 306.5b).",
    "fragment": "1",
    "navigation": {
      "previousRule": "208.5",
      "nextRule": "209.2"
    }
  },
  "209.2": {
    "ruleNumber": "209.2",
    "examples": null,
    "ruleText": "An activated ability with a loyalty symbol in its cost is a loyalty ability. Loyalty abilities follow special rules: A player may activate a loyalty ability of a permanent they control any time they have priority and the stack is empty during a main phase of their turn, but only if none of that permanent’s loyalty abilities have been activated that turn. See rule 606, “Loyalty Abilities.”",
    "fragment": "2",
    "navigation": {
      "previousRule": "209.1",
      "nextRule": null
    }
  },
  "210.1": {
    "ruleNumber": "210.1",
    "examples": null,
    "ruleText": "Each vanguard card has a hand modifier printed in its lower left corner. This is a number preceded by a plus sign, a number preceded by a minus sign, or a zero. This modifier is applied as the starting hand size and the maximum hand size of the vanguard card’s owner are determined. See rule 103.5.",
    "fragment": "1",
    "navigation": {
      "previousRule": "209.2",
      "nextRule": null
    }
  },
  "211.1": {
    "ruleNumber": "211.1",
    "examples": null,
    "ruleText": "Each vanguard card has a life modifier printed in its lower right corner. This is a number preceded by a plus sign, a number preceded by a minus sign, or a zero. This modifier is applied as the starting life total of the vanguard card’s owner is determined. See rule 103.4.",
    "fragment": "1",
    "navigation": {
      "previousRule": "210.1",
      "nextRule": null
    }
  },
  "212.1": {
    "ruleNumber": "212.1",
    "examples": null,
    "ruleText": "Each card features text printed below the text box that has no effect on game play. Not all card sets were printed with all of the information listed below on each card.",
    "fragment": "1",
    "navigation": {
      "previousRule": "211.1",
      "nextRule": "212.1a"
    }
  },
  "201.2a": {
    "ruleNumber": "201.2a",
    "examples": null,
    "ruleText": "Two or more objects have the same name if they have at least one name in common, even if one or more of those objects have additional names. An object with no name doesn’t have the same name as any other object, including another object with no name.",
    "fragment": "2a",
    "navigation": {
      "previousRule": "201.2",
      "nextRule": "201.2b"
    }
  },
  "201.2b": {
    "ruleNumber": "201.2b",
    "examples": [
      "A player controls Liliana’s Contract, which says, in part, “At the beginning of your upkeep, if you control four or more Demons with different names, you win the game.” That player controls three Demons with different names and a face-down creature with no name, with an effect making it a Demon. Because the four creatures include one with no name, those four creatures don’t count as four Demons with different names. The ability of Liliana’s Contract won’t trigger."
    ],
    "ruleText": "Some spells and abilities refer to two or more objects with different names. Those objects have different names only if each of them has at least one name and no two objects in that group have a name in common.",
    "fragment": "2b",
    "navigation": {
      "previousRule": "201.2a",
      "nextRule": "201.2c"
    }
  },
  "201.2c": {
    "ruleNumber": "201.2c",
    "examples": null,
    "ruleText": "Some spells or abilities check if one object has a different name than a second object or group of objects. The first object has a different name than those objects if the first object has at least one name and has no names in common with any of the other objects, even if one or more of the other objects have no names. If the first object has no name, it does not have a different name than any of the other objects, even if those other objects themselves have names.",
    "fragment": "2c",
    "navigation": {
      "previousRule": "201.2b",
      "nextRule": "201.3"
    }
  },
  "201.3a": {
    "ruleNumber": "201.3a",
    "examples": null,
    "ruleText": "For the purposes of all rules, abilities, and effects that refer to a card’s name, objects with interchangeable names have the same name. (See rules 201.2a–b.)",
    "fragment": "3a",
    "navigation": {
      "previousRule": "201.3",
      "nextRule": "201.3b"
    }
  },
  "201.3b": {
    "ruleNumber": "201.3b",
    "examples": null,
    "ruleText": "For the purposes of deck construction and format legality, cards with interchangeable names have the same name.",
    "fragment": "3b",
    "navigation": {
      "previousRule": "201.3a",
      "nextRule": "201.3c"
    }
  },
  "201.3c": {
    "ruleNumber": "201.3c",
    "examples": null,
    "ruleText": "If a card has later printings with interchangeable names, the later printings will have an interchangeable names indicator in the bottom left-hand corner referring to the original printing’s three-letter set code and collector number (see rule 212.1d).",
    "fragment": "3c",
    "navigation": {
      "previousRule": "201.3b",
      "nextRule": "201.4"
    }
  },
  "201.4a": {
    "ruleNumber": "201.4a",
    "examples": [
      "Dispossess reads, in part, “Choose an artifact card name.” The player can choose the name of any artifact card, even one that’s not legal in the format of the current game. The player can’t choose Island, even if an Island on the battlefield has been turned into artifact by some effect."
    ],
    "ruleText": "If a player is instructed to choose a card name with certain characteristics, the player must choose the name of a card whose Oracle text matches those characteristics. (See rule 108.1.)",
    "fragment": "4a",
    "navigation": {
      "previousRule": "201.4",
      "nextRule": "201.4b"
    }
  },
  "201.4b": {
    "ruleNumber": "201.4b",
    "examples": null,
    "ruleText": "If a player wants to choose the name of a split card, the player must choose the name of one of its halves, but not both. (See rule 709.) If a player is instructed to choose a card name with certain characteristics, use only that half’s characteristics to determine if this name can be chosen.",
    "fragment": "4b",
    "navigation": {
      "previousRule": "201.4a",
      "nextRule": "201.4c"
    }
  },
  "201.4c": {
    "ruleNumber": "201.4c",
    "examples": null,
    "ruleText": "If a player wants to choose a flip card’s alternative name, the player may do so. (See rule 710.) If a player is instructed to choose a card name with certain characteristics, use the card’s characteristics as modified by its alternative characteristics to determine if this name can be chosen.",
    "fragment": "4c",
    "navigation": {
      "previousRule": "201.4b",
      "nextRule": "201.4d"
    }
  },
  "201.4d": {
    "ruleNumber": "201.4d",
    "examples": null,
    "ruleText": "If a player wants to choose the name of the back face of a double-faced card, the player may do so. (See rule 712.) If a player is instructed to choose a card name with certain characteristics, use only the characteristics of the back face to determine if this name can be chosen.",
    "fragment": "4d",
    "navigation": {
      "previousRule": "201.4c",
      "nextRule": "201.4e"
    }
  },
  "201.4e": {
    "ruleNumber": "201.4e",
    "examples": null,
    "ruleText": "If a player wants to choose the name of the combined back face of a meld pair, the player may do so. (See rule 713.) If a player is instructed to choose a card name with certain characteristics, use only the characteristics of the combined back face to determine if this name can be chosen.",
    "fragment": "4e",
    "navigation": {
      "previousRule": "201.4d",
      "nextRule": "201.4f"
    }
  },
  "201.4f": {
    "ruleNumber": "201.4f",
    "examples": null,
    "ruleText": "If a player wants to choose an adventurer card’s alternative name, the player may do so. (See rule 716.) If a player is instructed to choose a card name with certain characteristics, use the card’s characteristics as modified by its alternative characteristics to determine if this name can be chosen.",
    "fragment": "4f",
    "navigation": {
      "previousRule": "201.4e",
      "nextRule": "201.4g"
    }
  },
  "201.4g": {
    "ruleNumber": "201.4g",
    "examples": null,
    "ruleText": "Some cards have interchangeable names (see rule 201.3). For all game purposes, these cards have the same name. If a player chooses the name of a card which has interchangeable names, the name of each of those cards has been chosen.",
    "fragment": "4g",
    "navigation": {
      "previousRule": "201.4f",
      "nextRule": "201.5"
    }
  },
  "201.5a": {
    "ruleNumber": "201.5a",
    "examples": [
      "Gutter Grime has an ability that reads “Whenever a nontoken creature you control dies, put a slime counter on Gutter Grime, then create a green Ooze creature token with ‘This creature’s power and toughness are each equal to the number of slime counters on Gutter Grime.’” The ability granted to the token only looks at the Gutter Grime that created the token, not at any other Gutter Grime on the battlefield. A copy of that token would also have an ability that referred only to the Gutter Grime that created the original token."
    ],
    "ruleText": "If an ability’s effect grants another ability to an object, and that second ability refers to that first ability’s source by name, the name refers only to the specific object which is that first ability’s source. The second ability does not refer to any other object with the same name as the first ability’s source. However, if the second ability also moved the first ability’s source to a different public zone, the name refers to the object the source became in its new zone. This is also true if the second ability is copied onto a new object.",
    "fragment": "5a",
    "navigation": {
      "previousRule": "201.5",
      "nextRule": "201.5b"
    }
  },
  "201.5b": {
    "ruleNumber": "201.5b",
    "examples": [
      "Quicksilver Elemental says, in part, “{U}: Quicksilver Elemental gains all activated abilities of target creature until end of turn.” If it gains an ability that says “{G}: Regenerate Cudgel Troll,” activating that ability will regenerate Quicksilver Elemental, not the Cudgel Troll it gained the ability from.",
      "Glacial Ray is an instant with splice onto Arcane that says “Glacial Ray deals 2 damage to any target.” If it’s spliced onto a Kodama’s Reach, that Kodama’s Reach deals 2 damage to the target.",
      "Dimir Doppelganger says “{1}{U}{B}: Exile target creature card from a graveyard. Dimir Doppelganger becomes a copy of that card and gains this ability.” Dimir Doppelganger’s ability is activated targeting a Runeclaw Bear card. The Doppelganger becomes a copy of Runeclaw Bear and gains an ability that should be treated as saying “{1}{U}{B}: Exile target creature card from a graveyard. Runeclaw Bear becomes a copy of that card and gains this ability.”"
    ],
    "ruleText": "If an ability of an object refers to that object by name, and an object with a different name gains that ability, each instance of the first name in the gained ability that refers to the first object by name should be treated as the second name.",
    "fragment": "5b",
    "navigation": {
      "previousRule": "201.5a",
      "nextRule": "201.5c"
    }
  },
  "201.5c": {
    "ruleNumber": "201.5c",
    "examples": null,
    "ruleText": "Text printed on some legendary cards refers to that card by a shortened version of its name. Instances of a card’s shortened name used in this manner are treated as though they used the card’s full name.",
    "fragment": "5c",
    "navigation": {
      "previousRule": "201.5b",
      "nextRule": "201.6"
    }
  },
  "202.1a": {
    "ruleNumber": "202.1a",
    "examples": null,
    "ruleText": "The mana cost of an object represents what a player must spend from their mana pool to cast that card. Unless an object’s mana cost includes Phyrexian mana symbols (see rule 107.4f), paying that mana cost requires matching the type of any colored or colorless mana symbols as well as paying the generic mana indicated in the cost.",
    "fragment": "1a",
    "navigation": {
      "previousRule": "202.1",
      "nextRule": "202.1b"
    }
  },
  "202.1b": {
    "ruleNumber": "202.1b",
    "examples": null,
    "ruleText": "Some objects have no mana cost. This normally includes all land cards, any other cards that have no mana symbols where their mana cost would appear, tokens (unless the effect that creates them specifies otherwise), and nontraditional Magic cards. Having no mana cost represents an unpayable cost (see rule 118.6). Note that lands are played without paying any costs (see rule 305, “Lands”).",
    "fragment": "1b",
    "navigation": {
      "previousRule": "202.1a",
      "nextRule": "202.2"
    }
  },
  "202.2a": {
    "ruleNumber": "202.2a",
    "examples": [
      "An object with a mana cost of {2}{W} is white, an object with a mana cost of {2} is colorless, and one with a mana cost of {2}{W}{B} is both white and black."
    ],
    "ruleText": "The five colors are white, blue, black, red, and green. The white mana symbol is represented by {W}, blue by {U}, black by {B}, red by {R}, and green by {G}.",
    "fragment": "2a",
    "navigation": {
      "previousRule": "202.2",
      "nextRule": "202.2b"
    }
  },
  "202.2b": {
    "ruleNumber": "202.2b",
    "examples": null,
    "ruleText": "Objects with no colored mana symbols in their mana costs are colorless.",
    "fragment": "2b",
    "navigation": {
      "previousRule": "202.2a",
      "nextRule": "202.2c"
    }
  },
  "202.2c": {
    "ruleNumber": "202.2c",
    "examples": null,
    "ruleText": "An object with two or more different colored mana symbols in its mana cost is each of the colors of those mana symbols. Most multicolored cards are printed with a gold frame, but this is not a requirement for a card to be multicolored.",
    "fragment": "2c",
    "navigation": {
      "previousRule": "202.2b",
      "nextRule": "202.2d"
    }
  },
  "202.2d": {
    "ruleNumber": "202.2d",
    "examples": null,
    "ruleText": "An object with one or more hybrid mana symbols and/or Phyrexian mana symbols in its mana cost is all of the colors of those mana symbols, in addition to any other colors the object might be. (Most cards with hybrid mana symbols in their mana costs are printed in a two-tone frame. See rule 107.4e.)",
    "fragment": "2d",
    "navigation": {
      "previousRule": "202.2c",
      "nextRule": "202.2e"
    }
  },
  "202.2e": {
    "ruleNumber": "202.2e",
    "examples": null,
    "ruleText": "An object may have a color indicator printed to the left of the type line. That object is each color denoted by that color indicator. (See rule 204.)",
    "fragment": "2e",
    "navigation": {
      "previousRule": "202.2d",
      "nextRule": "202.2f"
    }
  },
  "202.2f": {
    "ruleNumber": "202.2f",
    "examples": null,
    "ruleText": "Effects may change an object’s color, give a color to a colorless object, or make a colored object become colorless; see rule 105.3.",
    "fragment": "2f",
    "navigation": {
      "previousRule": "202.2e",
      "nextRule": "202.3"
    }
  },
  "202.3a": {
    "ruleNumber": "202.3a",
    "examples": null,
    "ruleText": "The mana value of an object with no mana cost is 0, unless that object is the back face of a transforming double-faced permanent or is a melded permanent.",
    "fragment": "3a",
    "navigation": {
      "previousRule": "202.3",
      "nextRule": "202.3b"
    }
  },
  "202.3b": {
    "ruleNumber": "202.3b",
    "examples": [
      "Huntmaster of the Fells is a transforming double-faced card with mana cost {2}{R}{G}. Its mana value is 4. After it transforms to its other face (Ravager of the Fells), its mana value remains 4.",
      "A Clone enters the battlefield as a copy of Ravager of the Fells. Its mana value is 0.",
      "Insectile Aberration is the back face of a transforming double-faced card whose front face has mana cost {U}. It becomes a copy of Ravager of the Fells. Its mana value becomes 0."
    ],
    "ruleText": "The mana value of a transforming double-faced permanent or spell’s back face is calculated as though it had the mana cost of its front face. If a permanent or spell is a copy of the back face of a transforming double-faced card (even if the card representing that copy is itself a double-faced card), the mana value of the copy is 0.",
    "fragment": "3b",
    "navigation": {
      "previousRule": "202.3a",
      "nextRule": "202.3c"
    }
  },
  "202.3c": {
    "ruleNumber": "202.3c",
    "examples": null,
    "ruleText": "The mana value of a melded permanent is calculated as though it had the combined mana cost of the front faces of each card that represents it. If a permanent is a copy of a melded permanent (even if that copy is represented by two other meld cards), the mana value of the copy is 0.",
    "fragment": "3c",
    "navigation": {
      "previousRule": "202.3b",
      "nextRule": "202.3d"
    }
  },
  "202.3d": {
    "ruleNumber": "202.3d",
    "examples": null,
    "ruleText": "The mana value of a split card not on the stack or of a fused split spell on the stack is determined from the combined mana costs of its halves. Otherwise, while a split card is on the stack, the mana value of the spell is determined by the mana cost of the half that was chosen to be cast. See rule 709, “Split Cards.”",
    "fragment": "3d",
    "navigation": {
      "previousRule": "202.3c",
      "nextRule": "202.3e"
    }
  },
  "202.3e": {
    "ruleNumber": "202.3e",
    "examples": null,
    "ruleText": "When calculating the mana value of an object with an {X} in its mana cost, X is treated as 0 while the object is not on the stack, and X is treated as the number chosen for it while the object is on the stack.",
    "fragment": "3e",
    "navigation": {
      "previousRule": "202.3d",
      "nextRule": "202.3f"
    }
  },
  "202.3f": {
    "ruleNumber": "202.3f",
    "examples": [
      "The mana value of a card with mana cost {1}{W/U}{W/U} is 3.",
      "The mana value of a card with mana cost {2/B}{2/B}{2/B} is 6."
    ],
    "ruleText": "When calculating the mana value of an object with a hybrid mana symbol in its mana cost, use the largest component of each hybrid symbol.",
    "fragment": "3f",
    "navigation": {
      "previousRule": "202.3e",
      "nextRule": "202.3g"
    }
  },
  "202.3g": {
    "ruleNumber": "202.3g",
    "examples": [
      "The mana value of a card with mana cost {1}{W/P}{W/P} is 3."
    ],
    "ruleText": "Each Phyrexian mana symbol in a card’s mana cost contributes 1 to its mana value.",
    "fragment": "3g",
    "navigation": {
      "previousRule": "202.3f",
      "nextRule": "202.4"
    }
  },
  "205.1a": {
    "ruleNumber": "205.1a",
    "examples": null,
    "ruleText": "Some effects set an object’s card type. In most such cases, the new card type(s) replaces any existing card types. However, an object with either the instant or sorcery card type retains that type. Counters, stickers, effects, and damage marked on the object remain with it, even if they are meaningless to the new card type. Similarly, when an effect sets one or more of an object’s subtypes, the new subtype(s) replaces any existing subtypes from the appropriate set (creature types, land types, artifact types, enchantment types, planeswalker types, or spell types). If an object’s card type is removed, the subtypes correlated with that card type will remain if they are also the subtypes of a card type the object currently has; otherwise, they are also removed for the entire time the object’s card type is removed. Removing an object’s subtype doesn’t affect its card types at all.",
    "fragment": "1a",
    "navigation": {
      "previousRule": "205.1",
      "nextRule": "205.1b"
    }
  },
  "205.1b": {
    "ruleNumber": "205.1b",
    "examples": [
      "An ability reads, “All lands are 1/1 creatures that are still lands.” The affected lands now have two card types: creature and land. If there were any lands that were also artifacts before the ability’s effect applied to them, those lands would become “artifact land creatures,” not just “creatures,” or “land creatures.” The effect allows them to retain both the artifact and land card types. In addition, each land affected by the ability retains any land types and supertypes it had before the ability took effect.",
      "An ability reads, “All artifacts are 1/1 artifact creatures.” If a permanent is both an artifact and an enchantment, it will become an artifact enchantment creature."
    ],
    "ruleText": "Some effects change an object’s card type, supertype, or subtype but specify that the object retains a prior card type, supertype, or subtype. In such cases, all the object’s prior card types, supertypes, and subtypes are retained. This rule applies to effects that use the phrase “in addition to its types” or that state that something is “still a [type, supertype, or subtype].” Some effects state that an object becomes an “artifact creature”; these effects also allow the object to retain all of its prior card types and subtypes. Some effects state that an object becomes a “[creature type or types] artifact creature”; these effects also allow the object to retain all of its prior card types and subtypes other than creature types, but replace any existing creature types.",
    "fragment": "1b",
    "navigation": {
      "previousRule": "205.1a",
      "nextRule": "205.2"
    }
  },
  "205.2a": {
    "ruleNumber": "205.2a",
    "examples": null,
    "ruleText": "The card types are artifact, battle, conspiracy, creature, dungeon, enchantment, instant, land, phenomenon, plane, planeswalker, scheme, sorcery, tribal, and vanguard. See section 3, “Card Types.”",
    "fragment": "2a",
    "navigation": {
      "previousRule": "205.2",
      "nextRule": "205.2b"
    }
  },
  "205.2b": {
    "ruleNumber": "205.2b",
    "examples": null,
    "ruleText": "Some objects have more than one card type (for example, an artifact creature). Such objects satisfy the criteria for any effect that applies to any of their card types.",
    "fragment": "2b",
    "navigation": {
      "previousRule": "205.2a",
      "nextRule": "205.2c"
    }
  },
  "205.2c": {
    "ruleNumber": "205.2c",
    "examples": null,
    "ruleText": "Tokens have card types even though they aren’t cards. The same is true of copies of spells and copies of cards.",
    "fragment": "2c",
    "navigation": {
      "previousRule": "205.2b",
      "nextRule": "205.3"
    }
  },
  "205.3a": {
    "ruleNumber": "205.3a",
    "examples": null,
    "ruleText": "A card can have one or more subtypes printed on its type line.",
    "fragment": "3a",
    "navigation": {
      "previousRule": "205.3",
      "nextRule": "205.3b"
    }
  },
  "205.3b": {
    "ruleNumber": "205.3b",
    "examples": [
      "“Basic Land — Mountain” means the card is a land with the subtype Mountain. “Creature — Goblin Wizard” means the card is a creature with the subtypes Goblin and Wizard. “Artifact — Equipment” means the card is an artifact with the subtype Equipment."
    ],
    "ruleText": "Subtypes of each card type except plane are always single words and are listed after a long dash. Each word after the dash is a separate subtype; such objects may have multiple types. Subtypes of planes are also listed after a long dash, but may be multiple words; all words after the dash are, collectively, a single subtype.",
    "fragment": "3b",
    "navigation": {
      "previousRule": "205.3a",
      "nextRule": "205.3c"
    }
  },
  "205.3c": {
    "ruleNumber": "205.3c",
    "examples": [
      "Dryad Arbor’s type line says “Land Creature — Forest Dryad.” Forest is a land type, and Dryad is a creature type."
    ],
    "ruleText": "If a card with multiple card types has one or more subtypes, each subtype is correlated to its appropriate card type.",
    "fragment": "3c",
    "navigation": {
      "previousRule": "205.3b",
      "nextRule": "205.3d"
    }
  },
  "205.3d": {
    "ruleNumber": "205.3d",
    "examples": null,
    "ruleText": "An object can’t gain a subtype that doesn’t correspond to one of that object’s types.",
    "fragment": "3d",
    "navigation": {
      "previousRule": "205.3c",
      "nextRule": "205.3e"
    }
  },
  "205.3e": {
    "ruleNumber": "205.3e",
    "examples": [
      "When choosing a creature type, “Merfolk” or “Wizard” is acceptable, but “Merfolk Wizard” is not. Words like “artifact,” “opponent,” “Swamp,” or “truck” can’t be chosen because they aren’t creature types."
    ],
    "ruleText": "If an effect instructs a player to choose a subtype, that player must choose one, and only one, existing subtype, and the subtype must be for the appropriate card type. For example, the player can’t choose a land type if an instruction requires choosing a creature type.",
    "fragment": "3e",
    "navigation": {
      "previousRule": "205.3d",
      "nextRule": "205.3f"
    }
  },
  "205.3f": {
    "ruleNumber": "205.3f",
    "examples": null,
    "ruleText": "Many cards were printed with subtypes that are now obsolete. Many cards have retroactively received subtypes. Use the Oracle card reference to determine what a card’s subtypes are. (See rule 108.1.)",
    "fragment": "3f",
    "navigation": {
      "previousRule": "205.3e",
      "nextRule": "205.3g"
    }
  },
  "205.3g": {
    "ruleNumber": "205.3g",
    "examples": null,
    "ruleText": "Artifacts have their own unique set of subtypes; these subtypes are called artifact types. The artifact types are Attraction (see rule 718), Blood, Clue, Contraption, Equipment (see rule 301.5), Food, Fortification (see rule 301.6), Gold, Powerstone, Treasure, and Vehicle (see rule 301.7).",
    "fragment": "3g",
    "navigation": {
      "previousRule": "205.3f",
      "nextRule": "205.3h"
    }
  },
  "205.3h": {
    "ruleNumber": "205.3h",
    "examples": null,
    "ruleText": "Enchantments have their own unique set of subtypes; these subtypes are called enchantment types. The enchantment types are Aura (see rule 303.4), Background, Cartouche, Class (see rule 717), Curse, Rune, Saga (see rule 715), Shard, and Shrine.",
    "fragment": "3h",
    "navigation": {
      "previousRule": "205.3g",
      "nextRule": "205.3i"
    }
  },
  "205.3i": {
    "ruleNumber": "205.3i",
    "examples": null,
    "ruleText": "Lands have their own unique set of subtypes; these subtypes are called land types. The land types are Desert, Forest, Gate, Island, Lair, Locus, Mine, Mountain, Plains, Power-Plant, Sphere, Swamp, Tower, and Urza’s. Of that list, Forest, Island, Mountain, Plains, and Swamp are the basic land types. See rule 305.6.",
    "fragment": "3i",
    "navigation": {
      "previousRule": "205.3h",
      "nextRule": "205.3j"
    }
  },
  "205.3j": {
    "ruleNumber": "205.3j",
    "examples": null,
    "ruleText": "Planeswalkers have their own unique set of subtypes; these subtypes are called planeswalker types. The planeswalker types are Ajani, Aminatou, Angrath, Arlinn, Ashiok, Bahamut, Basri, Bolas, Calix, Chandra, Comet, Dack, Dakkon, Daretti, Davriel, Dihada, Domri, Dovin, Ellywick, Elminster, Elspeth, Estrid, Freyalise, Garruk, Gideon, Grist, Huatli, Jace, Jared, Jaya, Jeska, Kaito, Karn, Kasmina, Kaya, Kiora, Koth, Liliana, Lolth, Lukka, Minsc, Mordenkainen, Nahiri, Narset, Niko, Nissa, Nixilis, Oko, Ral, Rowan, Saheeli, Samut, Sarkhan, Serra, Sivitri, Sorin, Szat, Tamiyo, Tasha, Teferi, Teyo, Tezzeret, Tibalt, Tyvar, Ugin, Urza, Venser, Vivien, Vraska, Will, Windgrace, Wrenn, Xenagos, Yanggu, Yanling, and Zariel.",
    "fragment": "3j",
    "navigation": {
      "previousRule": "205.3i",
      "nextRule": "205.3k"
    }
  },
  "205.3k": {
    "ruleNumber": "205.3k",
    "examples": null,
    "ruleText": "Instants and sorceries share their lists of subtypes; these subtypes are called spell types. The spell types are Adventure, Arcane, Lesson, and Trap.",
    "fragment": "3k",
    "navigation": {
      "previousRule": "205.3j",
      "nextRule": "205.3m"
    }
  },
  "205.3m": {
    "ruleNumber": "205.3m",
    "examples": null,
    "ruleText": "Creatures and tribals share their lists of subtypes; these subtypes are called creature types. The creature types are Advisor, Aetherborn, Alien, Ally, Angel, Antelope, Ape, Archer, Archon, Army, Artificer, Assassin, Assembly-Worker, Astartes, Atog, Aurochs, Avatar, Azra, Badger, Balloon, Barbarian, Bard, Basilisk, Bat, Bear, Beast, Beeble, Beholder, Berserker, Bird, Blinkmoth, Boar, Bringer, Brushwagg, Camarid, Camel, Caribou, Carrier, Cat, Centaur, Cephalid, Child, Chimera, Citizen, Cleric, Clown, Cockatrice, Construct, Coward, Crab, Crocodile, C’tan, Custodes, Cyclops, Dauthi, Demigod, Demon, Deserter, Devil, Dinosaur, Djinn, Dog, Dragon, Drake, Dreadnought, Drone, Druid, Dryad, Dwarf, Efreet, Egg, Elder, Eldrazi, Elemental, Elephant, Elf, Elk, Employee, Eye, Faerie, Ferret, Fish, Flagbearer, Fox, Fractal, Frog, Fungus, Gamer, Gargoyle, Germ, Giant, Gith, Gnoll, Gnome, Goat, Goblin, God, Golem, Gorgon, Graveborn, Gremlin, Griffin, Guest, Hag, Halfling, Hamster, Harpy, Hellion, Hippo, Hippogriff, Homarid, Homunculus, Horror, Horse, Human, Hydra, Hyena, Illusion, Imp, Incarnation, Inkling, Inquisitor, Insect, Jackal, Jellyfish, Juggernaut, Kavu, Kirin, Kithkin, Knight, Kobold, Kor, Kraken, Lamia, Lammasu, Leech, Leviathan, Lhurgoyf, Licid, Lizard, Manticore, Masticore, Mercenary, Merfolk, Metathran, Minion, Minotaur, Mite, Mole, Monger, Mongoose, Monk, Monkey, Moonfolk, Mouse, Mutant, Myr, Mystic, Naga, Nautilus, Necron, Nephilim, Nightmare, Nightstalker, Ninja, Noble, Noggle, Nomad, Nymph, Octopus, Ogre, Ooze, Orb, Orc, Orgg, Otter, Ouphe, Ox, Oyster, Pangolin, Peasant, Pegasus, Pentavite, Performer, Pest, Phelddagrif, Phoenix, Phyrexian, Pilot, Pincher, Pirate, Plant, Praetor, Primarch, Prism, Processor, Rabbit, Raccoon, Ranger, Rat, Rebel, Reflection, Rhino, Rigger, Robot, Rogue, Sable, Salamander, Samurai, Sand, Saproling, Satyr, Scarecrow, Scion, Scorpion, Scout, Sculpture, Serf, Serpent, Servo, Shade, Shaman, Shapeshifter, Shark, Sheep, Siren, Skeleton, Slith, Sliver, Slug, Snake, Soldier, Soltari, Spawn, Specter, Spellshaper, Sphinx, Spider, Spike, Spirit, Splinter, Sponge, Squid, Squirrel, Starfish, Surrakar, Survivor, Tentacle, Tetravite, Thalakos, Thopter, Thrull, Tiefling, Treefolk, Trilobite, Triskelavite, Troll, Turtle, Tyranid, Unicorn, Vampire, Vedalken, Viashino, Volver, Wall, Walrus, Warlock, Warrior, Weird, Werewolf, Whale, Wizard, Wolf, Wolverine, Wombat, Worm, Wraith, Wurm, Yeti, Zombie, and Zubera.",
    "fragment": "3m",
    "navigation": {
      "previousRule": "205.3k",
      "nextRule": "205.3n"
    }
  },
  "205.3n": {
    "ruleNumber": "205.3n",
    "examples": null,
    "ruleText": "Planes have their own unique set of subtypes; these subtypes are called planar types. The planar types are Alara, Arkhos, Azgol, Belenon, Bolas’s Meditation Realm, Dominaria, Equilor, Ergamon, Fabacin, Innistrad, Iquatana, Ir, Kaldheim, Kamigawa, Karsus, Kephalai, Kinshala, Kolbahan, Kyneth, Lorwyn, Luvion, Mercadia, Mirrodin, Moag, Mongseng, Muraganda, New Phyrexia, Phyrexia, Pyrulea, Rabiah, Rath, Ravnica, Regatha, Segovia, Serra’s Realm, Shadowmoor, Shandalar, Ulgrotha, Valla, Vryn, Wildfire, Xerex, and Zendikar.",
    "fragment": "3n",
    "navigation": {
      "previousRule": "205.3m",
      "nextRule": "205.3p"
    }
  },
  "205.3p": {
    "ruleNumber": "205.3p",
    "examples": null,
    "ruleText": "One dungeon card (Undercity) has a subtype; this subtype is called a dungeon type. That dungeon type is Undercity.",
    "fragment": "3p",
    "navigation": {
      "previousRule": "205.3n",
      "nextRule": "205.3q"
    }
  },
  "205.3q": {
    "ruleNumber": "205.3q",
    "examples": null,
    "ruleText": "Phenomenon cards, scheme cards, vanguard cards, and conspiracy cards have no subtypes.",
    "fragment": "3q",
    "navigation": {
      "previousRule": "205.3p",
      "nextRule": "205.4"
    }
  },
  "205.4a": {
    "ruleNumber": "205.4a",
    "examples": null,
    "ruleText": "An object can have one or more supertypes. A card’s supertypes are printed directly before its card types. The supertypes are basic, legendary, ongoing, snow, and world.",
    "fragment": "4a",
    "navigation": {
      "previousRule": "205.4",
      "nextRule": "205.4b"
    }
  },
  "205.4b": {
    "ruleNumber": "205.4b",
    "examples": [
      "An ability reads, “All lands are 1/1 creatures that are still lands.” If any of the affected lands were legendary, they are still legendary."
    ],
    "ruleText": "An object’s supertype is independent of its card type and subtype, even though some supertypes are closely identified with specific card types. Changing an object’s card types or subtypes won’t change its supertypes. Changing an object’s supertypes won’t change its card types or subtypes. When an object gains or loses a supertype, it retains any other supertypes it had.",
    "fragment": "4b",
    "navigation": {
      "previousRule": "205.4a",
      "nextRule": "205.4c"
    }
  },
  "205.4c": {
    "ruleNumber": "205.4c",
    "examples": null,
    "ruleText": "Any land with the supertype “basic” is a basic land. Any land that doesn’t have this supertype is a nonbasic land, even if it has a basic land type. Cards printed in sets prior to the Eighth Edition core set didn’t use the word “basic” to indicate a basic land. Cards from those sets with the following names are basic lands and have received errata in the Oracle card reference accordingly: Forest, Island, Mountain, Plains, Swamp, Snow-Covered Forest, Snow-Covered Island, Snow-Covered Mountain, Snow-Covered Plains, and Snow-Covered Swamp.",
    "fragment": "4c",
    "navigation": {
      "previousRule": "205.4b",
      "nextRule": "205.4d"
    }
  },
  "205.4d": {
    "ruleNumber": "205.4d",
    "examples": null,
    "ruleText": "Any permanent with the supertype “legendary” is subject to the state-based action for legendary permanents, also called the “legend rule” (see rule 704.5j).",
    "fragment": "4d",
    "navigation": {
      "previousRule": "205.4c",
      "nextRule": "205.4e"
    }
  },
  "205.4e": {
    "ruleNumber": "205.4e",
    "examples": null,
    "ruleText": "Any instant or sorcery spell with the supertype “legendary” is subject to a casting restriction. A player can’t cast a legendary instant or sorcery spell unless that player controls a legendary creature or a legendary planeswalker.",
    "fragment": "4e",
    "navigation": {
      "previousRule": "205.4d",
      "nextRule": "205.4f"
    }
  },
  "205.4f": {
    "ruleNumber": "205.4f",
    "examples": null,
    "ruleText": "Any permanent with the supertype “world” is subject to the state-based action for world permanents, also called the “world rule” (see rule 704.5k).",
    "fragment": "4f",
    "navigation": {
      "previousRule": "205.4e",
      "nextRule": "205.4g"
    }
  },
  "205.4g": {
    "ruleNumber": "205.4g",
    "examples": null,
    "ruleText": "Any permanent with the supertype “snow” is a snow permanent. Any permanent that doesn’t have this supertype is a nonsnow permanent, regardless of its name.",
    "fragment": "4g",
    "navigation": {
      "previousRule": "205.4f",
      "nextRule": "205.4h"
    }
  },
  "205.4h": {
    "ruleNumber": "205.4h",
    "examples": null,
    "ruleText": "Any scheme card with the supertype “ongoing” is exempt from the state-based action for schemes (see rule 704.6e).",
    "fragment": "4h",
    "navigation": {
      "previousRule": "205.4g",
      "nextRule": null
    }
  },
  "206.3a": {
    "ruleNumber": "206.3a",
    "examples": null,
    "ruleText": "One card (City in a Bottle) refers to permanents and cards with a name originally printed in the Arabian Nights™ expansion. Those names are Abu Ja’far, Aladdin, Aladdin’s Lamp, Aladdin’s Ring, Ali Baba, Ali from Cairo, Army of Allah, Bazaar of Baghdad, Bird Maiden, Bottle of Suleiman, Brass Man, Camel, City in a Bottle, City of Brass, Cuombajj Witches, Cyclone, Dancing Scimitar, Dandân, Desert, Desert Nomads, Desert Twister, Diamond Valley, Drop of Honey, Ebony Horse, Elephant Graveyard, El-Hajjâj, Erg Raiders, Erhnam Djinn, Eye for an Eye, Fishliver Oil, Flying Carpet, Flying Men, Ghazbán Ogre, Giant Tortoise, Guardian Beast, Hasran Ogress, Hurr Jackal, Ifh-Biff Efreet, Island Fish Jasconius, Island of Wak-Wak, Jandor’s Ring, Jandor’s Saddlebags, Jeweled Bird, Jihad, Junún Efreet, Juzám Djinn, Khabál Ghoul, King Suleiman, Kird Ape, Library of Alexandria, Magnetic Mountain, Merchant Ship, Metamorphosis, Mijae Djinn, Moorish Cavalry, Nafs Asp, Oasis, Old Man of the Sea, Oubliette, Piety, Pyramids, Repentant Blacksmith, Ring of Ma’rûf, Rukh Egg, Sandals of Abdallah, Sandstorm, Serendib Djinn, Serendib Efreet, Shahrazad, Sindbad, Singing Tree, Sorceress Queen, Stone-Throwing Devils, Unstable Mutation, War Elephant, Wyluli Wolf, and Ydwen Efreet.",
    "fragment": "3a",
    "navigation": {
      "previousRule": "206.3",
      "nextRule": "206.3b"
    }
  },
  "206.3b": {
    "ruleNumber": "206.3b",
    "examples": null,
    "ruleText": "One card (Golgothian Sylex) refers to permanents with a name originally printed in the Antiquities™ expansion. Those names are Amulet of Kroog, Argivian Archaeologist, Argivian Blacksmith, Argothian Pixies, Argothian Treefolk, Armageddon Clock, Artifact Blast, Artifact Possession, Artifact Ward, Ashnod’s Altar, Ashnod’s Battle Gear, Ashnod’s Transmogrant, Atog, Battering Ram, Bronze Tablet, Candelabra of Tawnos, Circle of Protection: Artifacts, Citanul Druid, Clay Statue, Clockwork Avian, Colossus of Sardia, Coral Helm, Crumble, Cursed Rack, Damping Field, Detonate, Drafna’s Restoration, Dragon Engine, Dwarven Weaponsmith, Energy Flux, Feldon’s Cane, Gaea’s Avenger, Gate to Phyrexia, Goblin Artisans, Golgothian Sylex, Grapeshot Catapult, Haunting Wind, Hurkyl’s Recall, Ivory Tower, Jalum Tome, Martyrs of Korlis, Mightstone, Millstone, Mishra’s Factory, Mishra’s War Machine, Mishra’s Workshop, Obelisk of Undoing, Onulet, Orcish Mechanics, Ornithopter, Phyrexian Gremlins, Power Artifact, Powerleech, Priest of Yawgmoth, Primal Clay, The Rack, Rakalite, Reconstruction, Reverse Polarity, Rocket Launcher, Sage of Lat-Nam, Shapeshifter, Shatterstorm, Staff of Zegon, Strip Mine, Su-Chi, Tablet of Epityr, Tawnos’s Coffin, Tawnos’s Wand, Tawnos’s Weaponry, Tetravus, Titania’s Song, Transmute Artifact, Triskelion, Urza’s Avenger, Urza’s Chalice, Urza’s Mine, Urza’s Miter, Urza’s Power Plant, Urza’s Tower, Wall of Spears, Weakstone, Xenic Poltergeist, Yawgmoth Demon, and Yotian Soldier.",
    "fragment": "3b",
    "navigation": {
      "previousRule": "206.3a",
      "nextRule": "206.3c"
    }
  },
  "206.3c": {
    "ruleNumber": "206.3c",
    "examples": null,
    "ruleText": "One card (Apocalypse Chime) refers to permanents with a name originally printed in the Homelands™ expansion. Those names are Abbey Gargoyles; Abbey Matron; Aether Storm; Aliban’s Tower; Ambush; Ambush Party; Anaba Ancestor; Anaba Bodyguard; Anaba Shaman; Anaba Spirit Crafter; An-Havva Constable; An-Havva Inn; An-Havva Township; An-Zerrin Ruins; Apocalypse Chime; Autumn Willow; Aysen Abbey; Aysen Bureaucrats; Aysen Crusader; Aysen Highway; Baki’s Curse; Baron Sengir; Beast Walkers; Black Carriage; Broken Visage; Carapace; Castle Sengir; Cemetery Gate; Chain Stasis; Chandler; Clockwork Gnomes; Clockwork Steed; Clockwork Swarm; Coral Reef; Dark Maze; Daughter of Autumn; Death Speakers; Didgeridoo; Drudge Spell; Dry Spell; Dwarven Pony; Dwarven Sea Clan; Dwarven Trader; Ebony Rhino; Eron the Relentless; Evaporate; Faerie Noble; Feast of the Unicorn; Feroz’s Ban; Folk of An-Havva; Forget; Funeral March; Ghost Hounds; Giant Albatross; Giant Oyster; Grandmother Sengir; Greater Werewolf; Hazduhr the Abbot; Headstone; Heart Wolf; Hungry Mist; Ihsan’s Shade; Irini Sengir; Ironclaw Curse; Jinx; Joven; Joven’s Ferrets; Joven’s Tools; Koskun Falls; Koskun Keep; Labyrinth Minotaur; Leaping Lizard; Leeches; Mammoth Harness; Marjhan; Memory Lapse; Merchant Scroll; Mesa Falcon; Mystic Decree; Narwhal; Orcish Mine; Primal Order; Prophecy; Rashka the Slayer; Reef Pirates; Renewal; Retribution; Reveka, Wizard Savant; Root Spider; Roots; Roterothopter; Rysorian Badger; Samite Alchemist; Sea Sprite; Sea Troll; Sengir Autocrat; Sengir Bats; Serra Aviary; Serra Bestiary; Serra Inquisitors; Serra Paladin; Serrated Arrows; Shrink; Soraya the Falconer; Spectral Bears; Timmerian Fiends; Torture; Trade Caravan; Truce; Veldrane of Sengir; Wall of Kelp; Willow Faerie; Willow Priestess; Winter Sky; and Wizards’ School.",
    "fragment": "3c",
    "navigation": {
      "previousRule": "206.3b",
      "nextRule": "206.4"
    }
  },
  "207.2a": {
    "ruleNumber": "207.2a",
    "examples": null,
    "ruleText": "Reminder text is italicized text within parentheses that summarizes a rule that applies to that card. It usually appears on the same line as the ability it’s relevant to, but it may appear on its own line if it applies to an aspect of the card other than an ability.",
    "fragment": "2a",
    "navigation": {
      "previousRule": "207.2",
      "nextRule": "207.2b"
    }
  },
  "207.2b": {
    "ruleNumber": "207.2b",
    "examples": null,
    "ruleText": "Flavor text is italicized text that, like the illustration, adds artistic appeal to the game. It usually appears below the rules text.",
    "fragment": "2b",
    "navigation": {
      "previousRule": "207.2a",
      "nextRule": "207.2c"
    }
  },
  "207.2c": {
    "ruleNumber": "207.2c",
    "examples": null,
    "ruleText": "An ability word appears in italics at the beginning of some abilities. Ability words are similar to keywords in that they tie together cards that have similar functionality, but they have no special rules meaning and no individual entries in the Comprehensive Rules. The ability words are adamant, addendum, alliance, battalion, bloodrush, channel, chroma, cohort, constellation, converge, council’s dilemma, coven, delirium, domain, eminence, enrage, fateful hour, ferocious, formidable, grandeur, hellbent, heroic, imprint, inspired, join forces, kinship, landfall, lieutenant, magecraft, metalcraft, morbid, pack tactics, parley, radiance, raid, rally, revolt, spell mastery, strive, sweep, tempting offer, threshold, undergrowth, and will of the council.",
    "fragment": "2c",
    "navigation": {
      "previousRule": "207.2b",
      "nextRule": "207.2d"
    }
  },
  "207.2d": {
    "ruleNumber": "207.2d",
    "examples": null,
    "ruleText": "Similar to ability words, flavor words appear in italics at the beginning of some abilities. Flavor words provide a flavorful description of abilities, but they have no special rules meaning and are not listed in the Comprehensive Rules. While an ability word ties together several abilities with similar functionality, each flavor word is tailored to the specific ability it appears with.",
    "fragment": "2d",
    "navigation": {
      "previousRule": "207.2c",
      "nextRule": "207.3"
    }
  },
  "208.2a": {
    "ruleNumber": "208.2a",
    "examples": [
      "Lost Order of Jarkeld has power and toughness each equal to 1+*. It has the abilities “As Lost Order of Jarkeld enters the battlefield, choose an opponent” and “Lost Order of Jarkeld’s power and toughness are each equal to 1 plus the number of creatures the chosen player controls.” While Lost Order of Jarkeld isn’t on the battlefield, there won’t be a chosen player. Its power and toughness will each be equal to 1 plus 0, so it’s 1/1."
    ],
    "ruleText": "The card may have a characteristic-defining ability that sets its power and/or toughness according to some stated condition. (See rule 604.3.) Such an ability is worded “[This creature’s] [power or toughness] is equal to . . .” or “[This creature’s] power and toughness are each equal to . . .” This ability functions everywhere, even outside the game. If the ability needs to use a number that can’t be determined, including inside a calculation, use 0 instead of that number.",
    "fragment": "2a",
    "navigation": {
      "previousRule": "208.2",
      "nextRule": "208.2b"
    }
  },
  "208.2b": {
    "ruleNumber": "208.2b",
    "examples": null,
    "ruleText": "The card may have a static ability that creates a replacement effect that sets the creature’s power and toughness to one of a number of specific values as it enters the battlefield or is turned face up. (See rule 614, “Replacement Effects.”) Such an ability is worded “As [this creature] enters the battlefield . . . ,” “As [this creature] is turned face up . . . ,” or “[This creature] enters the battlefield as . . .” and lists two or more specific power and toughness values (and may also list additional characteristics). The characteristics chosen or determined with these effects affect the creature’s copiable values. (See rule 707.2.) While the card isn’t on the battlefield, its power and toughness are each considered to be 0.",
    "fragment": "2b",
    "navigation": {
      "previousRule": "208.2a",
      "nextRule": "208.3"
    }
  },
  "208.3a": {
    "ruleNumber": "208.3a",
    "examples": [
      "Veteran Motorist has the ability “Whenever Veteran Motorist crews a Vehicle, that Vehicle gets +1/+1 until end of turn,” and it’s tapped to pay the crew cost of a Vehicle. This triggered ability resolves while the Vehicle it crewed isn’t yet a creature. The continuous effect is created and will apply to the Vehicle once it becomes a creature."
    ],
    "ruleText": "If an effect would be created that affects the power and/or toughness of a noncreature permanent, that effect is created even though it doesn’t do anything unless that permanent becomes a creature.",
    "fragment": "3a",
    "navigation": {
      "previousRule": "208.3",
      "nextRule": "208.4"
    }
  },
  "208.4a": {
    "ruleNumber": "208.4a",
    "examples": null,
    "ruleText": "Effects that set a creature’s power and/or toughness to specific values may refer to base power and/or toughness. Other continuous effects may further modify the creature’s power and toughness. See rule 613, “Interaction of Continuous Effects.”",
    "fragment": "4a",
    "navigation": {
      "previousRule": "208.4",
      "nextRule": "208.4b"
    }
  },
  "208.4b": {
    "ruleNumber": "208.4b",
    "examples": null,
    "ruleText": "Some effects check a creature’s base power and/or toughness. These effects see that creature’s characteristics after applying any characteristic-defining abilities and abilities that set power and/or toughness, ignoring any effects and counters that modify power and/or toughness without setting them. See rule 613, “Interaction of Continuous Effects.”",
    "fragment": "4b",
    "navigation": {
      "previousRule": "208.4a",
      "nextRule": "208.5"
    }
  },
  "212.1a": {
    "ruleNumber": "212.1a",
    "examples": null,
    "ruleText": "Most card sets feature collector numbers. This information is printed in the form [card number]/[total cards in the set] or simply [card number]. Some cards, such as unique cards in Planeswalker Decks, have card numbers that exceed the listed total number of cards.",
    "fragment": "1a",
    "navigation": {
      "previousRule": "212.1",
      "nextRule": "212.1b"
    }
  },
  "212.1b": {
    "ruleNumber": "212.1b",
    "examples": null,
    "ruleText": "A card’s rarity is indicated with a single letter following the collector number.",
    "fragment": "1b",
    "navigation": {
      "previousRule": "212.1a",
      "nextRule": "212.1c"
    }
  },
  "212.1c": {
    "ruleNumber": "212.1c",
    "examples": null,
    "ruleText": "Some promotional cards include information to indicate the specific promotion the card is associated with.",
    "fragment": "1c",
    "navigation": {
      "previousRule": "212.1b",
      "nextRule": "212.1d"
    }
  },
  "212.1d": {
    "ruleNumber": "212.1d",
    "examples": null,
    "ruleText": "Some cards with interchangeable names include information about a specific version of a card with that interchangeable name. See rule 201.3.",
    "fragment": "1d",
    "navigation": {
      "previousRule": "212.1c",
      "nextRule": "212.1e"
    }
  },
  "212.1e": {
    "ruleNumber": "212.1e",
    "examples": null,
    "ruleText": "The three-character code representing the set in which a card is printed and the two-character code representing the language in which a card is printed are separated by a bullet point. If a card is premium, these codes are instead separated by a star.",
    "fragment": "1e",
    "navigation": {
      "previousRule": "212.1d",
      "nextRule": "212.1f"
    }
  },
  "212.1f": {
    "ruleNumber": "212.1f",
    "examples": null,
    "ruleText": "The illustration credit for a card follows the paintbrush icon or, on older cards, the abbreviation “Illus.”",
    "fragment": "1f",
    "navigation": {
      "previousRule": "212.1e",
      "nextRule": "212.1g"
    }
  },
  "212.1g": {
    "ruleNumber": "212.1g",
    "examples": null,
    "ruleText": "Legal text (the fine print at the bottom or bottom-right of the card) lists the trademark and copyright information.",
    "fragment": "1g",
    "navigation": {
      "previousRule": "212.1f",
      "nextRule": null
    }
  }
}
