{
  "900.1": {
    "ruleNumber": "900.1",
    "examples": null,
    "ruleText": "This section contains additional optional rules that can be used for certain casual game variants. It is by no means comprehensive.",
    "fragment": "1",
    "navigation": {
      "previousRule": "811.5",
      "nextRule": "900.2"
    }
  },
  "900.2": {
    "ruleNumber": "900.2",
    "examples": null,
    "ruleText": "The casual variants detailed here use supplemental zones, rules, cards, and other game implements not used in traditional Magic games.",
    "fragment": "2",
    "navigation": {
      "previousRule": "900.1",
      "nextRule": null
    }
  },
  "901.1": {
    "ruleNumber": "901.1",
    "examples": null,
    "ruleText": "In the Planechase variant, plane cards and phenomenon cards add additional abilities and randomness to the game. The Planechase variant uses all the normal rules for a Magic game, with the following additions.",
    "fragment": "1",
    "navigation": {
      "previousRule": "900.2",
      "nextRule": "901.2"
    }
  },
  "901.2": {
    "ruleNumber": "901.2",
    "examples": null,
    "ruleText": "A Planechase game may be a two-player game or a multiplayer game. The default multiplayer setup is the Free-for-All variant with the attack multiple players option and without the limited range of influence option. See rule 806, “Free-for-All Variant.”",
    "fragment": "2",
    "navigation": {
      "previousRule": "901.1",
      "nextRule": "901.3"
    }
  },
  "901.3": {
    "ruleNumber": "901.3",
    "examples": null,
    "ruleText": "In addition to the normal game materials, each player needs a supplementary planar deck of at least ten plane and/or phenomenon cards and the game needs one planar die. No more than two cards in a planar deck can be phenomenon cards. Each card in a planar deck must have a different English name. (See rule 310, “Planes,” and rule 311, “Phenomena.”)",
    "fragment": "3",
    "navigation": {
      "previousRule": "901.2",
      "nextRule": "901.3a"
    }
  },
  "901.4": {
    "ruleNumber": "901.4",
    "examples": null,
    "ruleText": "All plane and phenomenon cards remain in the command zone throughout the game, both while they’re part of a planar deck and while they’re face up.",
    "fragment": "4",
    "navigation": {
      "previousRule": "901.3a",
      "nextRule": "901.5"
    }
  },
  "901.5": {
    "ruleNumber": "901.5",
    "examples": null,
    "ruleText": "Once all players have kept their opening hands and used the abilities of cards that allow them to take an action with those cards from their opening hands, the starting player moves the top card of their planar deck off that planar deck and turns it face up. If it’s a phenomenon card, the player puts that card on the bottom of their planar deck and repeats this process until a plane card is turned face up. (See rule 103.7.) No abilities of any card turned face up this way trigger during this process. The face-up plane card becomes the starting plane.",
    "fragment": "5",
    "navigation": {
      "previousRule": "901.4",
      "nextRule": "901.6"
    }
  },
  "901.6": {
    "ruleNumber": "901.6",
    "examples": null,
    "ruleText": "The owner of a plane or phenomenon card is the player who started the game with it in their planar deck. The controller of a face-up plane or phenomenon card is the player designated as the planar controller. Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first.",
    "fragment": "6",
    "navigation": {
      "previousRule": "901.5",
      "nextRule": "901.7"
    }
  },
  "901.7": {
    "ruleNumber": "901.7",
    "examples": null,
    "ruleText": "Any abilities of a face-up plane card or phenomenon card in the command zone function from that zone. The card’s static abilities affect the game, its triggered abilities may trigger, and its activated abilities may be activated.",
    "fragment": "7",
    "navigation": {
      "previousRule": "901.6",
      "nextRule": "901.7a"
    }
  },
  "901.8": {
    "ruleNumber": "901.8",
    "examples": null,
    "ruleText": "Planechase games have an inherent triggered ability known as the “planeswalking ability.” The full text of this ability is “Whenever you roll {PW}, planeswalk.” (See rule 701.24, “Planeswalk.”) This ability has no source and is controlled by the player whose planar die roll caused it to trigger. This is an exception to rule 113.8.",
    "fragment": "8",
    "navigation": {
      "previousRule": "901.7a",
      "nextRule": "901.9"
    }
  },
  "901.9": {
    "ruleNumber": "901.9",
    "examples": null,
    "ruleText": "Any time the active player has priority and the stack is empty, but only during a main phase of their turn, that player may roll the planar die. Taking this action costs a player an amount of mana equal to the number of times they have previously taken this action on that turn. This is a special action and doesn’t use the stack. Note that this number won’t be equal to the number of times the player has rolled the planar die that turn if an effect has caused the player to roll the planar die that turn. (See rule 116.2i.)",
    "fragment": "9",
    "navigation": {
      "previousRule": "901.8",
      "nextRule": "901.9a"
    }
  },
  "902.1": {
    "ruleNumber": "902.1",
    "examples": null,
    "ruleText": "In the Vanguard variant, a vanguard card allows each player to play the role of a famous character. Each player will have one face-up vanguard card whose abilities and other characteristics affect the game. The Vanguard variant uses all the normal rules for a Magic game, with the following additions.",
    "fragment": "1",
    "navigation": {
      "previousRule": "901.15c",
      "nextRule": "902.2"
    }
  },
  "902.2": {
    "ruleNumber": "902.2",
    "examples": null,
    "ruleText": "A Vanguard game may be a two-player game or a multiplayer game.",
    "fragment": "2",
    "navigation": {
      "previousRule": "902.1",
      "nextRule": "902.3"
    }
  },
  "902.3": {
    "ruleNumber": "902.3",
    "examples": null,
    "ruleText": "In addition to the normal game materials, each player needs a vanguard card. Each vanguard card is placed face up next to its owner’s library before the game begins. All vanguard cards remain in the command zone throughout the game.",
    "fragment": "3",
    "navigation": {
      "previousRule": "902.2",
      "nextRule": "902.4"
    }
  },
  "902.4": {
    "ruleNumber": "902.4",
    "examples": [
      "The life modifier of a player’s vanguard card is -3. That player’s starting life total is 17."
    ],
    "ruleText": "Each player’s starting life total is 20 plus or minus the life modifier of their vanguard card.",
    "fragment": "4",
    "navigation": {
      "previousRule": "902.3",
      "nextRule": "902.5"
    }
  },
  "902.5": {
    "ruleNumber": "902.5",
    "examples": null,
    "ruleText": "Each player’s starting hand size is seven cards, as modified by the hand modifier of their vanguard card.",
    "fragment": "5",
    "navigation": {
      "previousRule": "902.4",
      "nextRule": "902.5a"
    }
  },
  "902.6": {
    "ruleNumber": "902.6",
    "examples": null,
    "ruleText": "The owner of a vanguard card is the player who started the game with it in the command zone. The controller of a face-up vanguard card is its owner.",
    "fragment": "6",
    "navigation": {
      "previousRule": "902.5b",
      "nextRule": "902.7"
    }
  },
  "902.7": {
    "ruleNumber": "902.7",
    "examples": null,
    "ruleText": "Any abilities of a face-up vanguard card in the command zone function from that zone. The card’s static abilities affect the game, its triggered abilities may trigger, and its activated abilities may be activated.",
    "fragment": "7",
    "navigation": {
      "previousRule": "902.6",
      "nextRule": null
    }
  },
  "903.1": {
    "ruleNumber": "903.1",
    "examples": null,
    "ruleText": "In the Commander variant, each deck is led by a legendary creature designated as that deck’s commander. The Commander variant was created and popularized by fans; an independent rules committee maintains additional resources at MTGCommander.net. The Commander variant uses all the normal rules for a Magic game, with the following additions.",
    "fragment": "1",
    "navigation": {
      "previousRule": "902.7",
      "nextRule": "903.2"
    }
  },
  "903.2": {
    "ruleNumber": "903.2",
    "examples": null,
    "ruleText": "A Commander game may be a two-player game or a multiplayer game. The default multiplayer setup is the Free-for-All variant with the attack multiple players option and without the limited range of influence option. See rule 806, “Free-for-All Variant.”",
    "fragment": "2",
    "navigation": {
      "previousRule": "903.1",
      "nextRule": "903.3"
    }
  },
  "903.3": {
    "ruleNumber": "903.3",
    "examples": [
      "A commander that’s been turned face down (due to Ixidron’s effect, for example) is still a commander. A commander that’s copying another card (due to Cytoshape’s effect, for example) is still a commander. A permanent that’s copying a commander (such as a Body Double, for example, copying a commander in a player’s graveyard) is not a commander."
    ],
    "ruleText": "Each deck has a legendary creature card designated as its commander. This designation is not a characteristic of the object represented by the card; rather, it is an attribute of the card itself. The card retains this designation even when it changes zones.",
    "fragment": "3",
    "navigation": {
      "previousRule": "903.2",
      "nextRule": "903.3a"
    }
  },
  "903.4": {
    "ruleNumber": "903.4",
    "examples": [
      "Bosh, Iron Golem is a legendary artifact creature with mana cost {8} and the ability “{3}{R}, Sacrifice an artifact: Bosh, Iron Golem deals damage equal to the sacrificed artifact’s mana value to any target.” Bosh’s color identity is red."
    ],
    "ruleText": "The Commander variant uses color identity to determine what cards can be in a deck with a certain commander. The color identity of a card is the color or colors of any mana symbols in that card’s mana cost or rules text, plus any colors defined by its characteristic-defining abilities (see rule 604.3) or color indicator (see rule 204).",
    "fragment": "4",
    "navigation": {
      "previousRule": "903.3e",
      "nextRule": "903.4a"
    }
  },
  "903.5": {
    "ruleNumber": "903.5",
    "examples": null,
    "ruleText": "Each Commander deck is subject to the following deck construction rules.",
    "fragment": "5",
    "navigation": {
      "previousRule": "903.4e",
      "nextRule": "903.5a"
    }
  },
  "903.6": {
    "ruleNumber": "903.6",
    "examples": null,
    "ruleText": "At the start of the game, each player puts their commander from their deck face up into the command zone. Then each player shuffles the remaining cards of their deck so that the cards are in a random order. Those cards become the player’s library.",
    "fragment": "6",
    "navigation": {
      "previousRule": "903.5d",
      "nextRule": "903.7"
    }
  },
  "903.7": {
    "ruleNumber": "903.7",
    "examples": null,
    "ruleText": "Once the starting player has been determined, each player sets their life total to 40 and draws a hand of seven cards.",
    "fragment": "7",
    "navigation": {
      "previousRule": "903.6",
      "nextRule": "903.8"
    }
  },
  "903.8": {
    "ruleNumber": "903.8",
    "examples": null,
    "ruleText": "A player may cast a commander they own from the command zone. A commander cast from the command zone costs an additional {2} for each previous time the player casting it has cast it from the command zone that game. This additional cost is informally known as the “commander tax.”",
    "fragment": "8",
    "navigation": {
      "previousRule": "903.7",
      "nextRule": "903.9"
    }
  },
  "903.9": {
    "ruleNumber": "903.9",
    "examples": null,
    "ruleText": "A commander may return to the command zone during a Commander game.",
    "fragment": "9",
    "navigation": {
      "previousRule": "903.8",
      "nextRule": "903.9a"
    }
  },
  "904.1": {
    "ruleNumber": "904.1",
    "examples": null,
    "ruleText": "In the Archenemy variant, a team of players faces off against a single opponent strengthened with powerful scheme cards. The Archenemy variant uses all the normal rules for a Magic game, with the following additions.",
    "fragment": "1",
    "navigation": {
      "previousRule": "903.13g",
      "nextRule": "904.2"
    }
  },
  "904.2": {
    "ruleNumber": "904.2",
    "examples": null,
    "ruleText": "The default setup for an Archenemy game is the Team vs. Team multiplayer variant (see rule 808) involving exactly two teams. The attack multiple players option (see rule 802) and the shared team turns option (see rule 805) are used; no other multiplayer options are used.",
    "fragment": "2",
    "navigation": {
      "previousRule": "904.1",
      "nextRule": "904.2a"
    }
  },
  "904.3": {
    "ruleNumber": "904.3",
    "examples": null,
    "ruleText": "In addition to the normal game materials, the archenemy needs a supplementary scheme deck of at least twenty scheme cards. A scheme deck may contain no more than two of any card with a particular English name. (See rule 313, “Schemes.”)",
    "fragment": "3",
    "navigation": {
      "previousRule": "904.2b",
      "nextRule": "904.4"
    }
  },
  "904.4": {
    "ruleNumber": "904.4",
    "examples": null,
    "ruleText": "All scheme cards remain in the command zone throughout the game, both while they’re part of a scheme deck and while they’re face up.",
    "fragment": "4",
    "navigation": {
      "previousRule": "904.3",
      "nextRule": "904.5"
    }
  },
  "904.5": {
    "ruleNumber": "904.5",
    "examples": null,
    "ruleText": "The archenemy’s starting life total is 40. Each other player’s starting life total is 20.",
    "fragment": "5",
    "navigation": {
      "previousRule": "904.4",
      "nextRule": "904.6"
    }
  },
  "904.6": {
    "ruleNumber": "904.6",
    "examples": null,
    "ruleText": "Rather than a randomly determined player, the archenemy takes the first turn of the game.",
    "fragment": "6",
    "navigation": {
      "previousRule": "904.5",
      "nextRule": "904.7"
    }
  },
  "904.7": {
    "ruleNumber": "904.7",
    "examples": null,
    "ruleText": "The owner of a scheme card is the player who started the game with it in the command zone. The controller of a face-up scheme card is its owner.",
    "fragment": "7",
    "navigation": {
      "previousRule": "904.6",
      "nextRule": "904.8"
    }
  },
  "904.8": {
    "ruleNumber": "904.8",
    "examples": null,
    "ruleText": "Any abilities of a face-up scheme card in the command zone function from that zone. The card’s static abilities affect the game, its triggered abilities may trigger, and its activated abilities may be activated.",
    "fragment": "8",
    "navigation": {
      "previousRule": "904.7",
      "nextRule": "904.9"
    }
  },
  "904.9": {
    "ruleNumber": "904.9",
    "examples": null,
    "ruleText": "Immediately after the archenemy’s precombat main phase begins during each of their turns, that player moves the top card of their scheme deck off that scheme deck and turns it face up. This is called “setting that scheme in motion.” (See rule 701.25.) This turn-based action doesn’t use the stack. Abilities of that scheme card that trigger “When you set this scheme in motion” trigger.",
    "fragment": "9",
    "navigation": {
      "previousRule": "904.8",
      "nextRule": "904.10"
    }
  },
  "905.1": {
    "ruleNumber": "905.1",
    "examples": null,
    "ruleText": "The Conspiracy Draft variant consists of a draft (a style of limited play where players choose cards from sealed booster packs to build their decks) followed by a multiplayer game. The Conspiracy Draft variant uses Magic: The Gathering—Conspiracy™ and/or Conspiracy: Take the Crown™ booster packs by default.",
    "fragment": "1",
    "navigation": {
      "previousRule": "904.12c",
      "nextRule": "905.1a"
    }
  },
  "905.2": {
    "ruleNumber": "905.2",
    "examples": null,
    "ruleText": "Some cards have abilities that function during the draft.",
    "fragment": "2",
    "navigation": {
      "previousRule": "905.1d",
      "nextRule": "905.2a"
    }
  },
  "905.3": {
    "ruleNumber": "905.3",
    "examples": null,
    "ruleText": "A Conspiracy Draft game is a multiplayer game. The default multiplayer setup is the Free-for-All variant with the attack multiple players option and without the limited range of influence option. See rule 806, “Free-for-All Variant.”",
    "fragment": "3",
    "navigation": {
      "previousRule": "905.2c",
      "nextRule": "905.4"
    }
  },
  "905.4": {
    "ruleNumber": "905.4",
    "examples": null,
    "ruleText": "At the start of the game, before decks are shuffled, each player may put any number of conspiracy cards from their sideboard into the command zone.",
    "fragment": "4",
    "navigation": {
      "previousRule": "905.3",
      "nextRule": "905.4a"
    }
  },
  "905.5": {
    "ruleNumber": "905.5",
    "examples": null,
    "ruleText": "The owner of a conspiracy card is the player who put it into the command zone at the start of the game. The controller of a conspiracy card is its owner.",
    "fragment": "5",
    "navigation": {
      "previousRule": "905.4a",
      "nextRule": "905.6"
    }
  },
  "905.6": {
    "ruleNumber": "905.6",
    "examples": null,
    "ruleText": "Once the starting player has been determined, each player sets their life total to 20 and draws a hand of seven cards.",
    "fragment": "6",
    "navigation": {
      "previousRule": "905.5",
      "nextRule": null
    }
  },
  "901.10": {
    "ruleNumber": "901.10",
    "examples": null,
    "ruleText": "When a player leaves the game, all objects owned by that player except abilities from phenomena leave the game. (See rule 800.4a.) If that includes a face-up plane card or phenomenon card, the planar controller turns the top card of their planar deck face up. This is not a state-based action. It happens as soon as the player leaves the game.",
    "fragment": "10",
    "navigation": {
      "previousRule": "901.9d",
      "nextRule": "901.10a"
    }
  },
  "901.11": {
    "ruleNumber": "901.11",
    "examples": null,
    "ruleText": "After the game has started, if a player moves the top card of their planar deck off that planar deck and turns it face up, that player has “planeswalked.” Continuous effects with durations that last until a player planeswalks end. Abilities that trigger when a player planeswalks trigger. See rule 701.24.",
    "fragment": "11",
    "navigation": {
      "previousRule": "901.10b",
      "nextRule": "901.11a"
    }
  },
  "901.12": {
    "ruleNumber": "901.12",
    "examples": null,
    "ruleText": "A Two-Headed Giant Planechase game uses all the rules for the Two-Headed Giant multiplayer variant and all the rules for the Planechase casual variant, with the following additions.",
    "fragment": "12",
    "navigation": {
      "previousRule": "901.11c",
      "nextRule": "901.12a"
    }
  },
  "901.13": {
    "ruleNumber": "901.13",
    "examples": null,
    "ruleText": "In multiplayer formats other than Grand Melee, plane cards and phenomenon cards are exempt from the limited range of influence option. Their abilities, and the effects of those abilities, affect all applicable objects and players in the game. (See rule 801, “Limited Range of Influence Option.”)",
    "fragment": "13",
    "navigation": {
      "previousRule": "901.12d",
      "nextRule": "901.14"
    }
  },
  "901.14": {
    "ruleNumber": "901.14",
    "examples": null,
    "ruleText": "In Grand Melee Planechase games, multiple plane cards or phenomenon cards may be face up at the same time.",
    "fragment": "14",
    "navigation": {
      "previousRule": "901.13",
      "nextRule": "901.14a"
    }
  },
  "901.15": {
    "ruleNumber": "901.15",
    "examples": null,
    "ruleText": "Single Planar Deck Option",
    "fragment": "15",
    "navigation": {
      "previousRule": "901.14b",
      "nextRule": "901.15a"
    }
  },
  "901.3a": {
    "ruleNumber": "901.3a",
    "examples": null,
    "ruleText": "A planar die is a six-sided die. One face has the Planeswalker symbol {PW}. One face has the chaos symbol {CHAOS}. The other faces are blank.",
    "fragment": "3a",
    "navigation": {
      "previousRule": "901.3",
      "nextRule": "901.4"
    }
  },
  "901.7a": {
    "ruleNumber": "901.7a",
    "examples": null,
    "ruleText": "A face-up plane card or phenomenon card that’s turned face down becomes a new object.",
    "fragment": "7a",
    "navigation": {
      "previousRule": "901.7",
      "nextRule": "901.8"
    }
  },
  "901.9a": {
    "ruleNumber": "901.9a",
    "examples": null,
    "ruleText": "If the die roll is a blank face, nothing happens. The active player gets priority.",
    "fragment": "9a",
    "navigation": {
      "previousRule": "901.9",
      "nextRule": "901.9b"
    }
  },
  "901.9b": {
    "ruleNumber": "901.9b",
    "examples": null,
    "ruleText": "If the die roll is the chaos symbol {CHAOS}, any ability of a face-up plane that starts “When you roll {CHAOS}” triggers and is put on the stack. The active player gets priority.",
    "fragment": "9b",
    "navigation": {
      "previousRule": "901.9a",
      "nextRule": "901.9c"
    }
  },
  "901.9c": {
    "ruleNumber": "901.9c",
    "examples": null,
    "ruleText": "If the die roll is the Planeswalker symbol {PW}, the “planeswalking ability” triggers and is put on the stack. The active player gets priority. (See rule 901.8.)",
    "fragment": "9c",
    "navigation": {
      "previousRule": "901.9b",
      "nextRule": "901.9d"
    }
  },
  "901.9d": {
    "ruleNumber": "901.9d",
    "examples": null,
    "ruleText": "Rolling the planar die will cause any ability that triggers whenever a player rolls one or more dice to trigger. However, any effect that refers to a numerical result of a die roll, including ones that compare the results of that roll to other rolls or to a given number, ignores the rolling of the planar die. See 706, “Rolling a Die.”",
    "fragment": "9d",
    "navigation": {
      "previousRule": "901.9c",
      "nextRule": "901.10"
    }
  },
  "902.5a": {
    "ruleNumber": "902.5a",
    "examples": [
      "The hand modifier of a player’s vanguard card is +2. That player starts the game with a hand of 9 cards. If the player takes a mulligan three times before keeping, they draw a new hand of nine cards and put three of those on the bottom of their library."
    ],
    "ruleText": "If a player takes a mulligan in a Vanguard game, just like in a normal game, that player shuffles their hand back into their library, then draws a new hand equal to their starting hand size. (In a multiplayer game, a player’s first mulligan is for the same number of cards as they had before.) See rule 103.5.",
    "fragment": "5a",
    "navigation": {
      "previousRule": "902.5",
      "nextRule": "902.5b"
    }
  },
  "902.5b": {
    "ruleNumber": "902.5b",
    "examples": [
      "The hand modifier of a player’s vanguard card is -1. That player’s maximum hand size is six. If that player has more than six cards in their hand as their cleanup step begins, they will discard all but six of them."
    ],
    "ruleText": "A player’s maximum hand size is seven, as modified by the hand modifier of their vanguard card.",
    "fragment": "5b",
    "navigation": {
      "previousRule": "902.5a",
      "nextRule": "902.6"
    }
  },
  "903.10": {
    "ruleNumber": "903.10",
    "examples": null,
    "ruleText": "The Commander variant includes the following specification for winning and losing the game. All other rules for ending the game also apply. (See rule 104.)",
    "fragment": "10",
    "navigation": {
      "previousRule": "903.9c",
      "nextRule": "903.10a"
    }
  },
  "903.11": {
    "ruleNumber": "903.11",
    "examples": null,
    "ruleText": "If a player is allowed to bring a card from outside the game into a Commander game, that player can’t bring a card into the game this way if it has the same name as a card that player had in their starting deck, if it has the same name as a card that the player owns in the current game, or if any color in its color identity isn’t in the color identity of the player’s commander.",
    "fragment": "11",
    "navigation": {
      "previousRule": "903.10a",
      "nextRule": "903.12"
    }
  },
  "903.12": {
    "ruleNumber": "903.12",
    "examples": null,
    "ruleText": "Brawl Option",
    "fragment": "12",
    "navigation": {
      "previousRule": "903.11",
      "nextRule": "903.12a"
    }
  },
  "903.13": {
    "ruleNumber": "903.13",
    "examples": null,
    "ruleText": "Commander Draft",
    "fragment": "13",
    "navigation": {
      "previousRule": "903.12h",
      "nextRule": "903.13a"
    }
  },
  "903.3a": {
    "ruleNumber": "903.3a",
    "examples": null,
    "ruleText": "Some cards have an ability that states the card can be your commander. This ability modifies the rules for deck construction, and it functions before the game begins. See also rule 113.6n.",
    "fragment": "3a",
    "navigation": {
      "previousRule": "903.3",
      "nextRule": "903.3b"
    }
  },
  "903.3b": {
    "ruleNumber": "903.3b",
    "examples": null,
    "ruleText": "If a player’s commander is a meld card and it’s melded with the other member of its meld pair, the resulting melded permanent is that player’s commander.",
    "fragment": "3b",
    "navigation": {
      "previousRule": "903.3a",
      "nextRule": "903.3c"
    }
  },
  "903.3c": {
    "ruleNumber": "903.3c",
    "examples": null,
    "ruleText": "If a player’s commander is a component of a merged permanent, the resulting merged permanent is that player’s commander.",
    "fragment": "3c",
    "navigation": {
      "previousRule": "903.3b",
      "nextRule": "903.3d"
    }
  },
  "903.3d": {
    "ruleNumber": "903.3d",
    "examples": null,
    "ruleText": "If an effect refers to controlling a commander, it refers to a permanent on the battlefield that is a commander. If an effect refers to casting a commander, it refers to a spell that is a commander. If an effect refers to a commander in a specific zone, it refers to a card in that zone that is a commander.",
    "fragment": "3d",
    "navigation": {
      "previousRule": "903.3c",
      "nextRule": "903.3e"
    }
  },
  "903.3e": {
    "ruleNumber": "903.3e",
    "examples": null,
    "ruleText": "If an effect refers to a characteristic of “your commander,” it can find the appropriate player’s commander and see its current characteristics, as modified by continuous effects and other rules, in all zones, including that player’s library and hand.",
    "fragment": "3e",
    "navigation": {
      "previousRule": "903.3d",
      "nextRule": "903.4"
    }
  },
  "903.4a": {
    "ruleNumber": "903.4a",
    "examples": null,
    "ruleText": "Color identity is established before the game begins.",
    "fragment": "4a",
    "navigation": {
      "previousRule": "903.4",
      "nextRule": "903.4b"
    }
  },
  "903.4b": {
    "ruleNumber": "903.4b",
    "examples": null,
    "ruleText": "If a commander has a static ability that causes a player to choose its color before the game begins, that choice applies during deck construction and throughout the game, even as the commander changes zones. That choice affects the commander’s color identity. The player reveals that choice as they put their commander into the command zone before the game begins. See rules 103.2c and 607.2p.",
    "fragment": "4b",
    "navigation": {
      "previousRule": "903.4a",
      "nextRule": "903.4c"
    }
  },
  "903.4c": {
    "ruleNumber": "903.4c",
    "examples": null,
    "ruleText": "Reminder text is ignored when determining a card’s color identity. See rule 207.2.",
    "fragment": "4c",
    "navigation": {
      "previousRule": "903.4b",
      "nextRule": "903.4d"
    }
  },
  "903.4d": {
    "ruleNumber": "903.4d",
    "examples": [
      "Civilized Scholar is the front face of a double-faced card with mana cost {2}{U}. Homicidal Brute is the back face of that double-faced card and has a red color indicator. The card’s color identity is blue and red."
    ],
    "ruleText": "The back face of a double-faced card (see rule 712) is included when determining a card’s color identity. This is an exception to rule 712.4a.",
    "fragment": "4d",
    "navigation": {
      "previousRule": "903.4c",
      "nextRule": "903.4e"
    }
  },
  "903.4e": {
    "ruleNumber": "903.4e",
    "examples": null,
    "ruleText": "If an ability refers to the colors or number of colors in a commander’s color identity, that quality is undefined if that player doesn’t have a commander. That part of the ability won’t do anything. Costs that refer to that quality are unpayable.",
    "fragment": "4e",
    "navigation": {
      "previousRule": "903.4d",
      "nextRule": "903.5"
    }
  },
  "903.5a": {
    "ruleNumber": "903.5a",
    "examples": null,
    "ruleText": "Each deck must contain exactly 100 cards, including its commander. In other words, the minimum deck size and the maximum deck size are both 100.",
    "fragment": "5a",
    "navigation": {
      "previousRule": "903.5",
      "nextRule": "903.5b"
    }
  },
  "903.5b": {
    "ruleNumber": "903.5b",
    "examples": null,
    "ruleText": "Other than basic lands, each card in a Commander deck must have a different English name. For the purposes of deck construction, cards with interchangeable names have the same English name (see rule 201.3).",
    "fragment": "5b",
    "navigation": {
      "previousRule": "903.5a",
      "nextRule": "903.5c"
    }
  },
  "903.5c": {
    "ruleNumber": "903.5c",
    "examples": [
      "Wort, the Raidmother is a legendary creature with mana cost {4}{R/G}{R/G}. Wort’s color identity is red and green. Each card in a Wort Commander deck must be only red, only green, both red and green, or have no color. Each mana symbol in the mana cost or rules text of a card in this deck must be only red, only green, both red and green, or have no color."
    ],
    "ruleText": "A card can be included in a Commander deck only if every color in its color identity is also found in the color identity of the deck’s commander.",
    "fragment": "5c",
    "navigation": {
      "previousRule": "903.5b",
      "nextRule": "903.5d"
    }
  },
  "903.5d": {
    "ruleNumber": "903.5d",
    "examples": [
      "Wort, the Raidmother’s color identity is red and green. A Wort Commander deck may include land cards with the basic land types Mountain and/or Forest. It can’t include any land cards with the basic land types Plains, Island, or Swamp."
    ],
    "ruleText": "A card with a basic land type may be included in a Commander deck only if each color of mana it could produce is included in the commander’s color identity.",
    "fragment": "5d",
    "navigation": {
      "previousRule": "903.5c",
      "nextRule": "903.6"
    }
  },
  "903.9a": {
    "ruleNumber": "903.9a",
    "examples": null,
    "ruleText": "If a commander is in a graveyard or in exile and that object was put into that zone since the last time state-based actions were checked, its owner may put it into the command zone. This is a state-based action. See rule 704.",
    "fragment": "9a",
    "navigation": {
      "previousRule": "903.9",
      "nextRule": "903.9b"
    }
  },
  "903.9b": {
    "ruleNumber": "903.9b",
    "examples": null,
    "ruleText": "If a commander would be put into its owner’s hand or library from anywhere, its owner may put it into the command zone instead. This replacement effect may apply more than once to the same event. This is an exception to rule 614.5.",
    "fragment": "9b",
    "navigation": {
      "previousRule": "903.9a",
      "nextRule": "903.9c"
    }
  },
  "903.9c": {
    "ruleNumber": "903.9c",
    "examples": null,
    "ruleText": "If a commander is a melded permanent or a merged permanent and its owner chooses to put it into the command zone using the replacement effect described in rule 903.9b, that permanent and each component representing it that isn’t a commander are put into the appropriate zone, and the card that represents it and is a commander is put into the command zone.",
    "fragment": "9c",
    "navigation": {
      "previousRule": "903.9b",
      "nextRule": "903.10"
    }
  },
  "904.10": {
    "ruleNumber": "904.10",
    "examples": null,
    "ruleText": "If a non-ongoing scheme card is face up in the command zone, and no triggered abilities of any scheme are on the stack or waiting to be put on the stack, that scheme card is turned face down and put on the bottom of its owner’s scheme deck the next time a player would receive priority. (This is a state-based action. See rule 704.)",
    "fragment": "10",
    "navigation": {
      "previousRule": "904.9",
      "nextRule": "904.11"
    }
  },
  "904.11": {
    "ruleNumber": "904.11",
    "examples": null,
    "ruleText": "Once an ongoing scheme card is set in motion, it remains face up in the command zone until an ability causes it to be abandoned (see rule 701.26).",
    "fragment": "11",
    "navigation": {
      "previousRule": "904.10",
      "nextRule": "904.12"
    }
  },
  "904.12": {
    "ruleNumber": "904.12",
    "examples": null,
    "ruleText": "Supervillain Rumble Option",
    "fragment": "12",
    "navigation": {
      "previousRule": "904.11",
      "nextRule": "904.12a"
    }
  },
  "904.2a": {
    "ruleNumber": "904.2a",
    "examples": null,
    "ruleText": "One of the teams consists of exactly one player, who is designated the archenemy.",
    "fragment": "2a",
    "navigation": {
      "previousRule": "904.2",
      "nextRule": "904.2b"
    }
  },
  "904.2b": {
    "ruleNumber": "904.2b",
    "examples": null,
    "ruleText": "The other team consists of any number of players.",
    "fragment": "2b",
    "navigation": {
      "previousRule": "904.2a",
      "nextRule": "904.3"
    }
  },
  "905.1a": {
    "ruleNumber": "905.1a",
    "examples": null,
    "ruleText": "A draft typically consists of three draft rounds. In each draft round, each player opens a booster pack, drafts one card by placing that card in a face-down pile in front of the player, then passes the remaining cards to the next player. Each player then drafts a card from the booster pack passed to them and passes the remaining cards. This procedure continues until all cards in that draft round have been drafted.",
    "fragment": "1a",
    "navigation": {
      "previousRule": "905.1",
      "nextRule": "905.1b"
    }
  },
  "905.1b": {
    "ruleNumber": "905.1b",
    "examples": null,
    "ruleText": "In the first and third draft rounds, booster packs are passed to each player’s left. In the second draft round, booster packs are passed to each player’s right.",
    "fragment": "1b",
    "navigation": {
      "previousRule": "905.1a",
      "nextRule": "905.1c"
    }
  },
  "905.1c": {
    "ruleNumber": "905.1c",
    "examples": null,
    "ruleText": "During the draft, a player can look only at cards in the booster pack they are currently drafting from, cards they have already drafted, cards that are currently revealed as described in rule 905.2b, and cards that have been drafted face up as described in rule 905.2c. A player may not reveal drafted cards to other players unless an ability instructs them to.",
    "fragment": "1c",
    "navigation": {
      "previousRule": "905.1b",
      "nextRule": "905.1d"
    }
  },
  "905.1d": {
    "ruleNumber": "905.1d",
    "examples": null,
    "ruleText": "After the draft and all actions that may be taken during or after the draft, all the cards a player has drafted become that player’s card pool. The player builds their deck from only these cards and any number of basic land cards. See rules 100.2b and 100.4b.",
    "fragment": "1d",
    "navigation": {
      "previousRule": "905.1c",
      "nextRule": "905.2"
    }
  },
  "905.2a": {
    "ruleNumber": "905.2a",
    "examples": null,
    "ruleText": "During a draft, there is no active player or system of priority. If multiple players wish to take an action at the same time during the draft and can’t agree on an order, those actions are taken in a random order.",
    "fragment": "2a",
    "navigation": {
      "previousRule": "905.2",
      "nextRule": "905.2b"
    }
  },
  "905.2b": {
    "ruleNumber": "905.2b",
    "examples": null,
    "ruleText": "Some cards instruct players to reveal them as they’re drafted and then note some information, such as a number or color. This information can be referred to by other abilities during the game. Any player can look at this information at any time during the draft or game. After the information is noted, the drafted card is turned face down and added to the player’s drafted cards pile.",
    "fragment": "2b",
    "navigation": {
      "previousRule": "905.2a",
      "nextRule": "905.2c"
    }
  },
  "905.2c": {
    "ruleNumber": "905.2c",
    "examples": null,
    "ruleText": "Some cards instruct players to draft them face up. Each such card remains face up until the draft is complete, an effect instructs the person who drafted it to turn it face down, or the card leaves that player’s drafted cards pile. While the card is face up, all players may look at it.",
    "fragment": "2c",
    "navigation": {
      "previousRule": "905.2b",
      "nextRule": "905.3"
    }
  },
  "905.4a": {
    "ruleNumber": "905.4a",
    "examples": null,
    "ruleText": "Conspiracy cards with hidden agenda are put into the command zone face down. Any time a player has priority, they may turn a face-down conspiracy card they control face up. See rule 702.106, “Hidden Agenda.”",
    "fragment": "4a",
    "navigation": {
      "previousRule": "905.4",
      "nextRule": "905.5"
    }
  },
  "901.10a": {
    "ruleNumber": "901.10a",
    "examples": null,
    "ruleText": "If a plane leaves the game while a “planeswalking ability” is on the stack, that ability ceases to exist.",
    "fragment": "10a",
    "navigation": {
      "previousRule": "901.10",
      "nextRule": "901.10b"
    }
  },
  "901.10b": {
    "ruleNumber": "901.10b",
    "examples": null,
    "ruleText": "Abilities from phenomena owned by a player who left the game remain on the stack controlled by the new planar controller.",
    "fragment": "10b",
    "navigation": {
      "previousRule": "901.10a",
      "nextRule": "901.11"
    }
  },
  "901.11a": {
    "ruleNumber": "901.11a",
    "examples": null,
    "ruleText": "A player may planeswalk as the result of the “planeswalking ability” (see rule 901.8), because the owner of a face-up plane card or phenomenon card leaves the game (see rule 901.10), or because a phenomenon’s triggered ability leaves the stack (see rule 704.6f). Abilities may also instruct a player to planeswalk.",
    "fragment": "11a",
    "navigation": {
      "previousRule": "901.11",
      "nextRule": "901.11b"
    }
  },
  "901.11b": {
    "ruleNumber": "901.11b",
    "examples": null,
    "ruleText": "The plane card that’s turned face up is the plane the player planeswalks to. The plane card or phenomenon card that’s turned face down, or that leaves the game, is the plane or phenomenon the player planeswalks away from.",
    "fragment": "11b",
    "navigation": {
      "previousRule": "901.11a",
      "nextRule": "901.11c"
    }
  },
  "901.11c": {
    "ruleNumber": "901.11c",
    "examples": null,
    "ruleText": "If a player planeswalks when there is more than one face-up plane card, that player planeswalks away from all such planes.",
    "fragment": "11c",
    "navigation": {
      "previousRule": "901.11b",
      "nextRule": "901.12"
    }
  },
  "901.12a": {
    "ruleNumber": "901.12a",
    "examples": null,
    "ruleText": "Each player has their own planar deck.",
    "fragment": "12a",
    "navigation": {
      "previousRule": "901.12",
      "nextRule": "901.12b"
    }
  },
  "901.12b": {
    "ruleNumber": "901.12b",
    "examples": null,
    "ruleText": "The planar controller is normally the primary player of the active team. However, if the current planar controller’s team would leave the game, instead the primary player of the next team in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller’s team leaves the game. The new planar controller retains that designation until they leave the game or a different team becomes the active team, whichever comes first.",
    "fragment": "12b",
    "navigation": {
      "previousRule": "901.12a",
      "nextRule": "901.12c"
    }
  },
  "901.12c": {
    "ruleNumber": "901.12c",
    "examples": null,
    "ruleText": "Even though the face-up plane or phenomenon is controlled by just one player, any ability of that plane or phenomenon that refers to “you” applies to both members of the planar controller’s team.",
    "fragment": "12c",
    "navigation": {
      "previousRule": "901.12b",
      "nextRule": "901.12d"
    }
  },
  "901.12d": {
    "ruleNumber": "901.12d",
    "examples": null,
    "ruleText": "Since each member of the active team is an active player, each of them may roll the planar die. Each player’s cost to roll the planar die is based on the number of times that particular player has already rolled the planar die that turn.",
    "fragment": "12d",
    "navigation": {
      "previousRule": "901.12c",
      "nextRule": "901.13"
    }
  },
  "901.14a": {
    "ruleNumber": "901.14a",
    "examples": null,
    "ruleText": "Before the first turn of the game of the game, each player who will start the game with a turn marker sets a starting plane (see rule 901.5). Each of them is a planar controller.",
    "fragment": "14a",
    "navigation": {
      "previousRule": "901.14",
      "nextRule": "901.14b"
    }
  },
  "901.14b": {
    "ruleNumber": "901.14b",
    "examples": null,
    "ruleText": "If a player would leave the game and that player leaving the game would reduce the number of turn markers in the game, that player first ceases to be a planar controller (but no other player becomes a planar controller), then that player leaves the game. Each face-up plane card or phenomenon card that player controlled is put on the bottom of its owner’s planar deck. No player is considered to have planeswalked.",
    "fragment": "14b",
    "navigation": {
      "previousRule": "901.14a",
      "nextRule": "901.15"
    }
  },
  "901.15a": {
    "ruleNumber": "901.15a",
    "examples": null,
    "ruleText": "As an alternative option, a Planechase game may be played with just a single communal planar deck. In that case, the number of cards in the planar deck must be at least forty or at least ten times the number of players in the game, whichever is smaller. The planar deck can’t contain more phenomenon cards than twice the number of players in the game. Each card in the planar deck must have a different English name.",
    "fragment": "15a",
    "navigation": {
      "previousRule": "901.15",
      "nextRule": "901.15b"
    }
  },
  "901.15b": {
    "ruleNumber": "901.15b",
    "examples": null,
    "ruleText": "In a Planechase game using the single planar deck option, the planar controller is considered to be the owner of all cards in the planar deck.",
    "fragment": "15b",
    "navigation": {
      "previousRule": "901.15a",
      "nextRule": "901.15c"
    }
  },
  "901.15c": {
    "ruleNumber": "901.15c",
    "examples": null,
    "ruleText": "If any rule or ability refers to a player’s planar deck, the communal planar deck is used.",
    "fragment": "15c",
    "navigation": {
      "previousRule": "901.15b",
      "nextRule": null
    }
  },
  "903.10a": {
    "ruleNumber": "903.10a",
    "examples": null,
    "ruleText": "A player who’s been dealt 21 or more combat damage by the same commander over the course of the game loses the game. (This is a state-based action. See rule 704.)",
    "fragment": "10a",
    "navigation": {
      "previousRule": "903.10",
      "nextRule": "903.11"
    }
  },
  "903.12a": {
    "ruleNumber": "903.12a",
    "examples": null,
    "ruleText": "Brawl is an option for a different style of Commander game. Brawl games use the normal rules for the Commander variant with the following modifications.",
    "fragment": "12a",
    "navigation": {
      "previousRule": "903.12",
      "nextRule": "903.12b"
    }
  },
  "903.12b": {
    "ruleNumber": "903.12b",
    "examples": null,
    "ruleText": "Brawl decks are usually constructed using cards from the Standard format.",
    "fragment": "12b",
    "navigation": {
      "previousRule": "903.12a",
      "nextRule": "903.12c"
    }
  },
  "903.12c": {
    "ruleNumber": "903.12c",
    "examples": null,
    "ruleText": "A player designates either a legendary planeswalker or a legendary creature as their commander.",
    "fragment": "12c",
    "navigation": {
      "previousRule": "903.12b",
      "nextRule": "903.12d"
    }
  },
  "903.12d": {
    "ruleNumber": "903.12d",
    "examples": null,
    "ruleText": "A player’s deck must contain exactly 60 cards, including its commander. In other words, the minimum deck size and the maximum deck size are both 60.",
    "fragment": "12d",
    "navigation": {
      "previousRule": "903.12c",
      "nextRule": "903.12e"
    }
  },
  "903.12e": {
    "ruleNumber": "903.12e",
    "examples": null,
    "ruleText": "If a player’s commander has no colors in its color identity, that player’s deck may contain any number of basic lands of one basic land type of their choice. This is an exception to rule 903.5d.",
    "fragment": "12e",
    "navigation": {
      "previousRule": "903.12d",
      "nextRule": "903.12f"
    }
  },
  "903.12f": {
    "ruleNumber": "903.12f",
    "examples": null,
    "ruleText": "In a two-player Brawl game, each player’s starting life total is 25. In a multiplayer Brawl game, each player’s starting life total is 30.",
    "fragment": "12f",
    "navigation": {
      "previousRule": "903.12e",
      "nextRule": "903.12g"
    }
  },
  "903.12g": {
    "ruleNumber": "903.12g",
    "examples": null,
    "ruleText": "In any Brawl game, the first mulligan a player takes doesn’t count toward the number of cards that player will put on the bottom of their library or the number of mulligans that player may take. Subsequent mulligans are counted toward these numbers as normal.",
    "fragment": "12g",
    "navigation": {
      "previousRule": "903.12f",
      "nextRule": "903.12h"
    }
  },
  "903.12h": {
    "ruleNumber": "903.12h",
    "examples": null,
    "ruleText": "Brawl games do not use the state-based action described in rule 704.6c, which causes a player to lose the game if they’ve been dealt 21 or more combat damage by a commander.",
    "fragment": "12h",
    "navigation": {
      "previousRule": "903.12g",
      "nextRule": "903.13"
    }
  },
  "903.13a": {
    "ruleNumber": "903.13a",
    "examples": null,
    "ruleText": "Commander Draft is an option for a different style of Commander game. It consists of a draft (a style of limited play where players choose cards from sealed booster packs to build their decks) followed by a multiplayer game. The Commander Draft option uses Commander Legends booster packs by default.",
    "fragment": "13a",
    "navigation": {
      "previousRule": "903.13",
      "nextRule": "903.13b"
    }
  },
  "903.13b": {
    "ruleNumber": "903.13b",
    "examples": null,
    "ruleText": "A draft typically consists of three draft rounds. In each draft round, each player opens a booster pack, drafts two cards by placing them in a face-down pile in front of them, then passes the remaining cards to the next player. Each player then drafts two cards from the booster pack passed to them and passes the remaining cards. This procedure continues until all cards in that draft round have been drafted.",
    "fragment": "13b",
    "navigation": {
      "previousRule": "903.13a",
      "nextRule": "903.13c"
    }
  },
  "903.13c": {
    "ruleNumber": "903.13c",
    "examples": null,
    "ruleText": "In the first and third draft rounds, booster packs are passed to each player’s left. In the second draft round, booster packs are passed to each player’s right.",
    "fragment": "13c",
    "navigation": {
      "previousRule": "903.13b",
      "nextRule": "903.13d"
    }
  },
  "903.13d": {
    "ruleNumber": "903.13d",
    "examples": null,
    "ruleText": "During the draft, a player can look only at cards in the booster pack they are currently drafting from and cards they have already drafted. A player may not reveal drafted cards to other players unless an ability instructs them to.",
    "fragment": "13d",
    "navigation": {
      "previousRule": "903.13c",
      "nextRule": "903.13e"
    }
  },
  "903.13e": {
    "ruleNumber": "903.13e",
    "examples": null,
    "ruleText": "After the draft is complete, the cards a player drafted become that player’s card pool. If the draft contained draft boosters from Commander Legends, each player may add up to two cards named The Prismatic Piper to their card pool, but only if those cards are used as the player’s commander(s). If the draft contained draft boosters from Commander Legends: Battle for Baldur’s Gate®, each player may add up to two cards named Faceless One to their card pool, but only if those cards are used as the player’s commander(s).",
    "fragment": "13e",
    "navigation": {
      "previousRule": "903.13d",
      "nextRule": "903.13f"
    }
  },
  "903.13f": {
    "ruleNumber": "903.13f",
    "examples": null,
    "ruleText": "Commander Draft deck construction follows the same rules as Commander deck construction (see rule 903.5) with two exceptions: (1) A player’s deck must contain at least 60 cards. There is no maximum deck size. (2) A player’s deck may include any number of cards from that player’s card pool with the same name.",
    "fragment": "13f",
    "navigation": {
      "previousRule": "903.13e",
      "nextRule": "903.13g"
    }
  },
  "903.13g": {
    "ruleNumber": "903.13g",
    "examples": null,
    "ruleText": "Commander Draft games follow the same rules as Commander games. See rules 903.6–903.11.",
    "fragment": "13g",
    "navigation": {
      "previousRule": "903.13f",
      "nextRule": null
    }
  },
  "904.12a": {
    "ruleNumber": "904.12a",
    "examples": null,
    "ruleText": "As an alternative option, players may play a Free-for-All game in which each player has their own scheme deck. The attack multiple players option (see rule 802) is used; no other multiplayer options are used.",
    "fragment": "12a",
    "navigation": {
      "previousRule": "904.12",
      "nextRule": "904.12b"
    }
  },
  "904.12b": {
    "ruleNumber": "904.12b",
    "examples": null,
    "ruleText": "Each player in this game is an archenemy.",
    "fragment": "12b",
    "navigation": {
      "previousRule": "904.12a",
      "nextRule": "904.12c"
    }
  },
  "904.12c": {
    "ruleNumber": "904.12c",
    "examples": null,
    "ruleText": "As in a normal Free-for-All game, the starting player is randomly determined. All other rules that apply to the archenemy in an Archenemy game apply to each player in a Supervillain Rumble game.",
    "fragment": "12c",
    "navigation": {
      "previousRule": "904.12b",
      "nextRule": null
    }
  }
}
